[
  {
    "name": "https://en.wikipedia.org/wiki/Robotics",
    "Title": "Robotics",
    "bodytext": "Design, construction, use, and application of robots\n.mw-parser-output .ambox{border:1px solid #a2a9b1;border-left:10px solid #36c;background-color:#fbfbfb;box-sizing:border-box}.mw-parser-output .ambox+link+.ambox,.mw-parser-output .ambox+link+style+.ambox,.mw-parser-output .ambox+link+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+style+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+link+.ambox{margin-top:-1px}html body.mediawiki .mw-parser-output .ambox.mbox-small-left{margin:4px 1em 4px 0;overflow:hidden;width:238px;border-collapse:collapse;font-size:88%;line-height:1.25em}.mw-parser-output .ambox-speedy{border-left:10px solid #b32424;background-color:#fee7e6}.mw-parser-output .ambox-delete{border-left:10px solid #b32424}.mw-parser-output .ambox-content{border-left:10px solid #f28500}.mw-parser-output .ambox-style{border-left:10px solid #fc3}.mw-parser-output .ambox-move{border-left:10px solid #9932cc}.mw-parser-output .ambox-protection{border-left:10px solid #a2a9b1}.mw-parser-output .ambox .mbox-text{border:none;padding:0.25em 0.5em;width:100%}.mw-parser-output .ambox .mbox-image{border:none;padding:2px 0 2px 0.5em;text-align:center}.mw-parser-output .ambox .mbox-imageright{border:none;padding:2px 0.5em 2px 0;text-align:center}.mw-parser-output .ambox .mbox-empty-cell{border:none;padding:0;width:1px}.mw-parser-output .ambox .mbox-image-div{width:52px}@media(min-width:720px){.mw-parser-output .ambox{margin:0 10%}}@media print{body.ns-0 .mw-parser-output .ambox{display:none!important}}This article may relate to a different subject or has undue weight on an aspect of the subject. Specifically, the article goes in too much detail on specific types of robot and includes product placement. Please help relocate relevant information and remove irrelevant content.  (August 2024)\n\n\nRoboticists with three Mars rover robots. Front and center is the flight spare for the first Mars rover, Sojourner, which landed on Mars in 1997 as part of the Mars Pathfinder Project. On the left is a Mars Exploration Rover (MER) test vehicle that is a working sibling to Spirit and Opportunity, which landed on Mars in 2004. On the right is a test rover for the Mars Science Laboratory, which landed Curiosity on Mars in 2012.\nRobotics is the interdisciplinary study and practice of the design, construction, operation, and use of robots.[1]\nWithin mechanical engineering, robotics is the design and construction of the physical structures of robots, while in computer science, robotics focuses on robotic automation algorithms. Other disciplines contributing to robotics include electrical, control, software, information, electronic, telecommunication, computer, mechatronic, and materials engineering.\nThe goal of most robotics is to design machines that can help and assist humans. Many robots are built to do jobs that are hazardous to people, such as finding survivors in unstable ruins, and exploring space, mines and shipwrecks. Others replace people in jobs that are boring, repetitive, or unpleasant, such as cleaning, monitoring, transporting, and assembling. Today, robotics is a rapidly growing field, as technological advances continue; researching, designing, and building new robots serve various practical purposes.\n\n\nRobotics aspects[edit]\nMechanical aspect\nElectrical aspect\nSoftware aspect\nRobotics usually combines three aspects of design work to create robot systems:\n\nMechanical construction: a frame, form or shape designed to achieve a particular task. For example, a robot designed to travel across heavy dirt or mud might use caterpillar tracks. Origami inspired robots can sense and analyze in extreme environments.[2] The mechanical aspect of the robot is mostly the creator's solution to completing the assigned task and dealing with the physics of the environment around it. Form follows function.\nElectrical components that power and control the machinery. For example, the robot with caterpillar tracks would need some kind of power to move the tracker treads. That power comes in the form of electricity, which will have to travel through a wire and originate from a battery, a basic electrical circuit. Even petrol-powered machines that get their power mainly from petrol still require an electric current to start the combustion process which is why most petrol-powered machines like cars, have batteries. The electrical aspect of robots is used for movement (through motors), sensing (where electrical signals are used to measure things like heat, sound, position, and energy status), and operation (robots need some level of electrical energy supplied to their motors and sensors in order to activate and perform basic operations)\nSoftware. A program is how a robot decides when or how to do something. In the caterpillar track example, a robot that needs to move across a muddy road may have the correct mechanical construction and receive the correct amount of power from its battery, but would not be able to go anywhere without a program telling it to move. Programs are the core essence of a robot, it could have excellent mechanical and electrical construction, but if its program is poorly structured, its performance will be very poor (or it may not perform at all). There are three different types of robotic programs: remote control, artificial intelligence, and hybrid. A robot with remote control programming has a preexisting set of commands that it will only perform if and when it receives a signal from a control source, typically a human being with remote control. It is perhaps more appropriate to view devices controlled primarily by human commands as falling in the discipline of automation rather than robotics. Robots that use artificial intelligence interact with their environment on their own without a control source, and can determine reactions to objects and problems they encounter using their preexisting programming. A hybrid is a form of programming that incorporates both AI and RC functions in them.[3]\nApplied robotics[edit]\nAs more and more robots are designed for specific tasks, this method of classification becomes more relevant. For example, many robots are designed for assembly work, which may not be readily adaptable for other applications. They are termed \"assembly robots\". For seam welding, some suppliers provide complete welding systems with the robot i.e. the welding equipment along with other material handling facilities like turntables, etc. as an integrated unit. Such an integrated robotic system is called a \"welding robot\" even though its discrete manipulator unit could be adapted to a variety of tasks. Some robots are specifically designed for heavy load manipulation, and are labeled as \"heavy-duty robots\".[4]\nCurrent and potential applications include:\n\nManufacturing. Robots have been increasingly used in manufacturing since the 1960s. According to the Robotic Industries Association US data, in 2016 the automotive industry was the main customer of industrial robots with 52% of total sales.[5] In the auto industry, they can amount for more than half of the \"labor\". There are even \"lights off\" factories such as an IBM keyboard manufacturing factory in Texas that was fully automated as early as 2003.[6]\nAutonomous transport including airplane autopilot and self-driving cars\nDomestic robots including robotic vacuum cleaners, robotic lawn mowers, dishwasher loading[7] and flatbread baking.[8]\nConstruction robots. Construction robots can be separated into three types: traditional robots, robotic arm, and robotic exoskeleton.[9]\nAutomated mining.\nSpace exploration, including Mars rovers.\nEnergy applications including cleanup of nuclear contaminated areas;[a] and cleaning solar panel arrays.\nMedical robots and Robot-assisted surgery designed and used in clinics.[11]\nAgricultural robots.[12] The use of robots in agriculture is closely linked to the concept of AI-assisted precision agriculture and drone usage.[13]\nFood processing. Commercial examples of kitchen automation are Flippy (burgers), Zume Pizza (pizza), Cafe X (coffee), Makr Shakr (cocktails), Frobot (frozen yogurts), Sally (salads),[14] salad or food bowl robots manufactured by Dexai (a Draper Laboratory spinoff, operating on military bases), and integrated food bowl assembly systems manufactured by Spyce Kitchen (acquired by Sweetgreen) and Silicon Valley startup Hyphen.[15] Other examples may include manufacturing technologies based on 3D Food Printing.\nMilitary robots.\nRobot sports for entertainment and education, including Robot combat, Autonomous racing, drone racing, and FIRST Robotics.\nMechanical robotics areas[edit]\nPower source[edit]\n.mw-parser-output .hatnote{font-style:italic}.mw-parser-output div.hatnote{padding-left:1.6em;margin-bottom:0.5em}.mw-parser-output .hatnote i{font-style:normal}.mw-parser-output .hatnote+link+.hatnote{margin-top:-0.5em}@media print{body.ns-0 .mw-parser-output .hatnote{display:none!important}}Further information: Power supply and Energy storage\nThe InSight lander with solar panels deployed in a cleanroom\nAt present, mostly (lead–acid) batteries are used as a power source. Many different types of batteries can be used as a power source for robots. They range from lead–acid batteries, which are safe and have relatively long shelf lives but are rather heavy compared to silver–cadmium batteries which are much smaller in volume and are currently much more expensive. Designing a battery-powered robot needs to take into account factors such as safety, cycle lifetime, and weight. Generators, often some type of internal combustion engine, can also be used. However, such designs are often mechanically complex and need fuel, require heat dissipation, and are relatively heavy. A tether connecting the robot to a power supply would remove the power supply from the robot entirely. This has the advantage of saving weight and space by moving all power generation and storage components elsewhere. However, this design does come with the drawback of constantly having a cable connected to the robot, which can be difficult to manage.[16] \nPotential power sources could be:\n\npneumatic (compressed gases)\nSolar power (using the sun's energy and converting it into electrical power)\nhydraulics (liquids)\nflywheel energy storage\norganic garbage (through anaerobic digestion)\nnuclear\nActuation[edit]\nMain article: Actuator\nA robotic leg powered by air muscles \nActuators are the \"muscles\" of a robot, the parts which convert stored energy into movement.[17] By far the most popular actuators are electric motors that rotate a wheel or gear, and linear actuators that control industrial robots in factories. There are some recent advances in alternative types of actuators, powered by electricity, chemicals, or compressed air.\n\nElectric motors[edit]\nMain article: Electric motor\nThe vast majority of robots use electric motors, often brushed and brushless DC motors in portable robots or AC motors in industrial robots and CNC machines. These motors are often preferred in systems with lighter loads, and where the predominant form of motion is rotational.\n\nLinear actuators[edit]\nMain article: Linear actuator\nVarious types of linear actuators move in and out instead of by spinning, and often have quicker direction changes, particularly when very large forces are needed such as with industrial robotics. They are typically powered by compressed and oxidized air (pneumatic actuator) or an oil (hydraulic actuator) Linear actuators can also be powered by electricity which usually consists of a motor and a leadscrew. Another common type is a mechanical linear actuator such as a rack and pinion on a car.\n\nSeries elastic actuators[edit]\nSeries elastic actuation (SEA) relies on the idea of introducing intentional elasticity between the motor actuator and the load for robust force control. Due to the resultant lower reflected inertia, series elastic actuation improves safety when a robot interacts with the environment (e.g., humans or workpieces) or during collisions.[18] Furthermore, it also provides energy efficiency and shock absorption (mechanical filtering) while reducing excessive wear on the transmission and other mechanical components. This approach has successfully been employed in various robots, particularly advanced manufacturing robots[19] and walking humanoid robots.[20][21]\nThe controller design of a series elastic actuator is most often performed within the passivity framework as it ensures the safety of interaction with unstructured environments.[22] Despite its remarkable stability and robustness, this framework suffers from the stringent limitations imposed on the controller which may trade-off performance. The reader is referred to the following survey which summarizes the common controller architectures for SEA along with the corresponding sufficient passivity conditions.[23] One recent study has derived the necessary and sufficient passivity conditions for one of the most common impedance control architectures, namely velocity-sourced SEA.[24] This work is of particular importance as it drives the non-conservative passivity bounds in an SEA scheme for the first time which allows a larger selection of control gains.\n\nAir muscles[edit]\nMain article: Pneumatic artificial muscles\nPneumatic artificial muscles also known as air muscles, are special tubes that expand (typically up to 42%) when air is forced inside them. They are used in some robot applications.[25][26][27]\n\nWire muscles[edit]\nMain article: Shape memory alloy\nMuscle wire, also known as shape memory alloy, is a material that contracts (under 5%) when electricity is applied. They have been used for some small robot applications.[28][29]\n\nElectroactive polymers[edit]\nMain article: Electroactive polymers\nEAPs or EPAMs are a plastic material that can contract substantially (up to 380% activation strain) from electricity, and have been used in facial muscles and arms of humanoid robots,[30] and to enable new robots to float,[31] fly, swim or walk.[32]\n\nPiezo motors[edit]\nMain article: Piezoelectric motor\nRecent alternatives to DC motors are piezo motors or ultrasonic motors. These work on a fundamentally different principle, whereby tiny piezoceramic elements, vibrating many thousands of times per second, cause linear or rotary motion. There are different mechanisms of operation; one type uses the vibration of the piezo elements to step the motor in a circle or a straight line.[33] Another type uses the piezo elements to cause a nut to vibrate or to drive a screw. The advantages of these motors are nanometer resolution, speed, and available force for their size.[34] These motors are already available commercially and being used on some robots.[35][36]\n\nElastic nanotubes[edit]\nFurther information: Carbon nanotube\nElastic nanotubes are a promising artificial muscle technology in early-stage experimental development. The absence of defects in carbon nanotubes enables these filaments to deform elastically by several percent, with energy storage levels of perhaps 10 J/cm3 for metal nanotubes. Human biceps could be replaced with an 8 mm diameter wire of this material. Such compact \"muscle\" might allow future robots to outrun and outjump humans.[37]\n\nSensing[edit]\nMain articles: Robotic sensing and Robotic sensors\nSensors allow robots to receive information about a certain measurement of the environment, or internal components. This is essential for robots to perform their tasks, and act upon any changes in the environment to calculate the appropriate response. They are used for various forms of measurements, to give the robots warnings about safety or malfunctions, and to provide real-time information about the task it is performing.\n\nTouch[edit]\nMain article: Tactile sensor\nCurrent robotic and prosthetic hands receive far less tactile information than the human hand. Recent research has developed a tactile sensor array that mimics the mechanical properties and touch receptors of human fingertips.[38][39] The sensor array is constructed as a rigid core surrounded by conductive fluid contained by an elastomeric skin. Electrodes are mounted on the surface of the rigid core and are connected to an impedance-measuring device within the core. When the artificial skin touches an object the fluid path around the electrodes is deformed, producing impedance changes that map the forces received from the object. The researchers expect that an important function of such artificial fingertips will be adjusting the robotic grip on held objects.\nScientists from several European countries and Israel developed a prosthetic hand in 2009, called SmartHand, which functions like a real one —allowing patients to write with it, type on a keyboard, play piano, and perform other fine movements. The prosthesis has sensors which enable the patient to sense real feelings in its fingertips.[40]\n\nFurther information: Sensory-motor map\nOther[edit]\nOther common forms of sensing in robotics use lidar, radar, and sonar.[41] Lidar measures the distance to a target by illuminating the target with laser light and measuring the reflected light with a sensor. Radar uses radio waves to determine the range, angle, or velocity of objects. Sonar uses sound propagation to navigate, communicate with or detect objects on or under the surface of the water.\n\nMechanical grippers[edit]\nOne of the most common types of end-effectors are \"grippers\". In its simplest manifestation, it consists of just two fingers that can open and close to pick up and let go of a range of small objects. Fingers can, for example, be made of a chain with a metal wire running through it.[42] Hands that resemble and work more like a human hand include the Shadow Hand and the Robonaut hand.[43] Hands that are of a mid-level complexity include the Delft hand.[44][45] Mechanical grippers can come in various types, including friction and encompassing jaws. Friction jaws use all the force of the gripper to hold the object in place using friction. Encompassing jaws cradle the object in place, using less friction.\n\nSuction end-effectors[edit]\nSuction end-effectors, powered by vacuum generators, are very simple astrictive[46] devices that can hold very large loads provided the prehension surface is smooth enough to ensure suction.\nPick and place robots for electronic components and for large objects like car windscreens, often use very simple vacuum end-effectors.\nSuction is a highly used type of end-effector in industry, in part because the natural compliance of soft suction end-effectors can enable a robot to be more robust in the presence of imperfect robotic perception. As an example: consider the case of a robot vision system that estimates the position of a water bottle but has 1 centimeter of error. While this may cause a rigid mechanical gripper to puncture the water bottle, the soft suction end-effector may just bend slightly and conform to the shape of the water bottle surface.\n\nGeneral purpose effectors[edit]\nSome advanced robots are beginning to use fully humanoid hands, like the Shadow Hand, MANUS,[47] and the Schunk hand.[48] They have powerful robot dexterity intelligence (RDI), with as many as 20 degrees of freedom and hundreds of tactile sensors.[49]\n\nControl robotics areas[edit]\nPuppet Magnus, a robot-manipulated marionette with complex control systems\nExperimental planar robot arm and sensor-based, open-architecture robot controller\nRuBot II can manually resolve Rubik's cubes.\nFurther information: Control system and Principles of motion sensing\nThe mechanical structure of a robot must be controlled to perform tasks.[50] The control of a robot involves three distinct phases – perception, processing, and action (robotic paradigms).[51] Sensors give information about the environment or the robot itself (e.g. the position of its joints or its end effector). This information is then processed to be stored or transmitted and to calculate the appropriate signals to the actuators (motors), which move the mechanical structure to achieve the required co-ordinated motion or force actions.\nThe processing phase can range in complexity. At a reactive level, it may translate raw sensor information directly into actuator commands (e.g. firing motor power electronic gates based directly upon encoder feedback signals to achieve the required torque/velocity of the shaft). Sensor fusion and internal models may first be used to estimate parameters of interest (e.g. the position of the robot's gripper) from noisy sensor data. An immediate task (such as moving the gripper in a certain direction until an object is detected with a proximity sensor) is sometimes inferred from these estimates. Techniques from control theory are generally used to convert the higher-level tasks into individual commands that drive the actuators, most often using kinematic and dynamic models of the mechanical structure.[50][51][52]\nAt longer time scales or with more sophisticated tasks, the robot may need to build and reason with a \"cognitive\" model. Cognitive models try to represent the robot, the world, and how the two interact. Pattern recognition and computer vision can be used to track objects.[50] Mapping techniques can be used to build maps of the world. Finally, motion planning and other artificial intelligence techniques may be used to figure out how to act. For example, a planner may figure out how to achieve a task without hitting obstacles, falling over, etc.\nModern commercial robotic control systems are highly complex, integrate multiple sensors and effectors, have many interacting degrees-of-freedom (DOF) and require operator interfaces, programming tools and real-time capabilities.[51] They are oftentimes interconnected to wider communication networks and in many cases are now both IoT-enabled and mobile.[53] Progress towards open architecture, layered, user-friendly and 'intelligent' sensor-based interconnected robots has emerged from earlier concepts related to Flexible Manufacturing Systems (FMS), and several 'open or 'hybrid' reference architectures exist which assist developers of robot control software and hardware to move beyond traditional, earlier notions of 'closed' robot control systems have been proposed.[52] Open architecture controllers are said to be better able to meet the growing requirements of a wide range of robot users, including system developers, end users and research scientists, and are better positioned to deliver the advanced robotic concepts related to Industry 4.0.[52] In addition to utilizing many established features of robot controllers, such as position, velocity and force control of end effectors, they also enable IoT interconnection and the implementation of more advanced sensor fusion and control techniques, including adaptive control, Fuzzy control and Artificial Neural Network (ANN)-based control.[52] When implemented in real-time, such techniques can potentially improve the stability and performance of robots operating in unknown or uncertain environments by enabling the control systems to learn and adapt to environmental changes.[54] There are several examples of reference architectures for robot controllers, and also examples of successful implementations of actual robot controllers developed from them. One example of a generic reference architecture and associated interconnected, open-architecture robot and controller implementation was used in a number of research and development studies, including prototype implementation of novel advanced and intelligent control and environment mapping methods in real-time.[54][55]\n\nManipulation[edit]\nKUKA industrial robot operating in a foundry\nPuma, one of the first industrial robots\nBaxter, a modern and versatile industrial robot developed by Rodney Brooks\nLefty, first checker playing robot\nFurther information: Mobile manipulator\nA definition of robotic manipulation has been provided by Matt Mason as: \"manipulation refers to an agent's control of its environment through selective contact\".[56]\nRobots need to manipulate objects; pick up, modify, destroy, move or otherwise have an effect. Thus the functional end of a robot arm intended to make the effect (whether a hand, or tool) are often referred to as end effectors,[57] while the \"arm\" is referred to as a manipulator.[58] Most robot arms have replaceable end-effectors, each allowing them to perform some small range of tasks. Some have a fixed manipulator that cannot be replaced, while a few have one very general-purpose manipulator, for example, a humanoid hand.[59]\n\nLocomotion[edit]\nMain articles: Robot locomotion and Mobile robot\nRolling robots[edit]\nSegway in the Robot museum in Nagoya\nFor simplicity, most mobile robots have four wheels or a number of continuous tracks. Some researchers have tried to create more complex wheeled robots with only one or two wheels. These can have certain advantages such as greater efficiency and reduced parts, as well as allowing a robot to navigate in confined places that a four-wheeled robot would not be able to.\n\nTwo-wheeled balancing robots[edit]\nBalancing robots generally use a gyroscope to detect how much a robot is falling and then drive the wheels proportionally in the same direction, to counterbalance the fall at hundreds of times per second, based on the dynamics of an inverted pendulum.[60] Many different balancing robots have been designed.[61] While the Segway is not commonly thought of as a robot, it can be thought of as a component of a robot, when used as such Segway refer to them as RMP (Robotic Mobility Platform). An example of this use has been as NASA's Robonaut that has been mounted on a Segway.[62]\n\nOne-wheeled balancing robots[edit]\nMain article: Self-balancing unicycle\nA one-wheeled balancing robot is an extension of a two-wheeled balancing robot so that it can move in any 2D direction using a round ball as its only wheel. Several one-wheeled balancing robots have been designed recently, such as Carnegie Mellon University's \"Ballbot\" which is the approximate height and width of a person, and Tohoku Gakuin University's \"BallIP\".[63] Because of the long, thin shape and ability to maneuver in tight spaces, they have the potential to function better than other robots in environments with people.[64]\n\nSpherical orb robots[edit]\nMain article: Spherical robot\nSeveral attempts have been made in robots that are completely inside a spherical ball, either by spinning a weight inside the ball,[65][66] or by rotating the outer shells of the sphere.[67][68] These have also been referred to as an orb bot[69] or a ball bot.[70][71]\n\nSix-wheeled robots[edit]\nUsing six wheels instead of four wheels can give better traction or grip in outdoor terrain such as on rocky dirt or grass.\n\nTracked robots[edit]\nTracks provide even more traction than a six-wheeled robot. Tracked wheels behave as if they were made of hundreds of wheels, therefore are very common for outdoor off-road robots, where the robot must drive on very rough terrain. However, they are difficult to use indoors such as on carpets and smooth floors. Examples include NASA's Urban Robot \"Urbie\".[72]\n\nWalking robots[edit]\nFurther information: Mantis the spider robot\nWalking is a difficult and dynamic problem to solve. Several robots have been made which can walk reliably on two legs, however, none have yet been made which are as robust as a human. There has been much study on human-inspired walking, such as AMBER lab which was established in 2008 by the Mechanical Engineering Department at Texas A\u0026M University.[73] Many other robots have been built that walk on more than two legs, due to these robots being significantly easier to construct.[74][75] Walking robots can be used for uneven terrains, which would provide better mobility and energy efficiency than other locomotion methods. Typically, robots on two legs can walk well on flat floors and can occasionally walk up stairs. None can walk over rocky, uneven terrain. Some of the methods which have been tried are:\n\nZMP technique[edit]\nMain article: Zero moment point\nThe zero moment point (ZMP) is the algorithm used by robots such as Honda's ASIMO. The robot's onboard computer tries to keep the total inertial forces (the combination of Earth's gravity and the acceleration and deceleration of walking), exactly opposed by the floor reaction force (the force of the floor pushing back on the robot's foot). In this way, the two forces cancel out, leaving no moment (force causing the robot to rotate and fall over).[76] However, this is not exactly how a human walks, and the difference is obvious to human observers, some of whom have pointed out that ASIMO walks as if it needs the lavatory.[77][78][79] ASIMO's walking algorithm is not static, and some dynamic balancing is used (see below). However, it still requires a smooth surface to walk on.\n\nHopping[edit]\nSeveral robots, built in the 1980s by Marc Raibert at the MIT Leg Laboratory, successfully demonstrated very dynamic walking. Initially, a robot with only one leg, and a very small foot could stay upright simply by hopping. The movement is the same as that of a person on a pogo stick. As the robot falls to one side, it would jump slightly in that direction, in order to catch itself.[80] Soon, the algorithm was generalised to two and four legs. A bipedal robot was demonstrated running and even performing somersaults.[81] A quadruped was also demonstrated which could trot, run, pace, and bound.[82] For a full list of these robots, see the MIT Leg Lab Robots page.[83]\n\nDynamic balancing (controlled falling)[edit]\nA more advanced way for a robot to walk is by using a dynamic balancing algorithm, which is potentially more robust than the Zero Moment Point technique, as it constantly monitors the robot's motion, and places the feet in order to maintain stability.[84] This technique was recently demonstrated by Anybots' Dexter Robot,[85] which is so stable, it can even jump.[86] Another example is the TU Delft Flame.\n\nPassive dynamics[edit]\nMain article: Passive dynamics\nPerhaps the most promising approach uses passive dynamics where the momentum of swinging limbs is used for greater efficiency. It has been shown that totally unpowered humanoid mechanisms can walk down a gentle slope, using only gravity to propel themselves. Using this technique, a robot need only supply a small amount of motor power to walk along a flat surface or a little more to walk up a hill. This technique promises to make walking robots at least ten times more efficient than ZMP walkers, like ASIMO.[87][88]\n\n\nFlying[edit]\nA modern passenger airliner is essentially a flying robot, with two humans to manage it. The autopilot can control the plane for each stage of the journey, including takeoff, normal flight, and even landing.[89] Other flying robots are uninhabited and are known as unmanned aerial vehicles (UAVs). They can be smaller and lighter without a human pilot on board, and fly into dangerous territory for military surveillance missions. Some can even fire on targets under command. UAVs are also being developed which can fire on targets automatically, without the need for a command from a human. Other flying robots include cruise missiles, the Entomopter, and the Epson micro helicopter robot. Robots such as the Air Penguin, Air Ray, and Air Jelly have lighter-than-air bodies, are propelled by paddles, and are guided by sonar.\n\nBiomimetic flying robots (BFRs)[edit]\nA flapping wing BFR generating lift and thrust.\nBFRs take inspiration from flying mammals, birds, or insects. BFRs can have flapping wings, which generate the lift and thrust, or they can be propeller actuated. BFRs with flapping wings have increased stroke efficiencies, increased maneuverability, and reduced energy consumption in comparison to propeller actuated BFRs.[90] Mammal and bird inspired BFRs share similar flight characteristics and design considerations. For instance, both mammal and bird inspired BFRs minimize edge fluttering and pressure-induced wingtip curl by increasing the rigidity of the wing edge and wingtips. Mammal and insect inspired BFRs can be impact resistant, making them useful in cluttered environments.\nMammal inspired BFRs typically take inspiration from bats, but the flying squirrel has also inspired a prototype.[91] Examples of bat inspired BFRs include Bat Bot[92] and the DALER.[93] Mammal inspired BFRs can be designed to be multi-modal; therefore, they're capable of both flight and terrestrial movement. To reduce the impact of landing, shock absorbers can be implemented along the wings.[93] Alternatively, the BFR can pitch up and increase the amount of drag it experiences.[91] By increasing the drag force, the BFR will decelerate and minimize the impact upon grounding. Different land gait patterns can also be implemented.[91]\n\nDragonfly inspired BFR.\nBird inspired BFRs can take inspiration from raptors, gulls, and everything in-between. Bird inspired BFRs can be feathered to increase the angle of attack range over which the prototype can operate before stalling.[94] The wings of bird inspired BFRs allow for in-plane deformation, and the in-plane wing deformation can be adjusted to maximize flight efficiency depending on the flight gait.[94] An example of a raptor inspired BFR is the prototype by Savastano et al.[95] The prototype has fully deformable flapping wings and is capable of carrying a payload of up to 0.8 kg while performing a parabolic climb, steep descent, and rapid recovery. The gull inspired prototype by Grant et al. accurately mimics the elbow and wrist rotation of gulls, and they find that lift generation is maximized when the elbow and wrist deformations are opposite but equal.[96]\nInsect inspired BFRs typically take inspiration from beetles or dragonflies. An example of a beetle inspired BFR is the prototype by Phan and Park,[97] and a dragonfly inspired BFR is the prototype by Hu et al.[98] The flapping frequency of insect inspired BFRs are much higher than those of other BFRs; this is because of the aerodynamics of insect flight.[99] Insect inspired BFRs are much smaller than those inspired by mammals or birds, so they are more suitable for dense environments.\n\nBiologically-inspired flying robots[edit]\nVisualization of entomopter flying on Mars (NASA)\nA class of robots that are biologically inspired, but which do not attempt to mimic biology, are creations such as the Entomopter. Funded by DARPA, NASA, the United States Air Force, and the Georgia Tech Research Institute and patented by Prof. Robert C. Michelson for covert terrestrial missions as well as flight in the lower Mars atmosphere, the Entomopter flight propulsion system uses low Reynolds number wings similar to those of the hawk moth (Manduca sexta), but flaps them in a non-traditional \"opposed x-wing fashion\" while \"blowing\" the surface to enhance lift based on the Coandă effect as well as to control vehicle attitude and direction. Waste gas from the propulsion system not only facilitates the blown wing aerodynamics, but also serves to create ultrasonic emissions like that of a Bat for obstacle avoidance. The Entomopter and other biologically-inspired robots leverage features of biological systems, but do not attempt to create mechanical analogs.\n\nSnaking[edit]\nTwo robot snakes. The left one has 64 motors (with 2 degrees of freedom per segment), the right one 10.\nSeveral snake robots have been successfully developed. Mimicking the way real snakes move, these robots can navigate very confined spaces, meaning they may one day be used to search for people trapped in collapsed buildings.[100] The Japanese ACM-R5 snake robot[101] can even navigate both on land and in water.[102]\n\nSkating[edit]\nA small number of skating robots have been developed, one of which is a multi-mode walking and skating device. It has four legs, with unpowered wheels, which can either step or roll.[103] Another robot, Plen, can use a miniature skateboard or roller-skates, and skate across a desktop.[104]\n\nCapuchin, a climbing robot\nClimbing[edit]\nSeveral different approaches have been used to develop robots that have the ability to climb vertical surfaces. One approach mimics the movements of a human climber on a wall with protrusions; adjusting the center of mass and moving each limb in turn to gain leverage. An example of this is Capuchin,[105] built by Ruixiang Zhang at Stanford University, California. Another approach uses the specialized toe pad method of wall-climbing geckoes, which can run on smooth surfaces such as vertical glass. Examples of this approach include Wallbot[106] and Stickybot.[107]\nChina's Technology Daily reported on 15 November 2008, that Li Hiu Yeung and his research group of New Concept Aircraft (Zhuhai) Co., Ltd. had successfully developed a bionic gecko robot named \"Speedy Freelander\". According to Yeung, the gecko robot could rapidly climb up and down a variety of building walls, navigate through ground and wall fissures, and walk upside-down on the ceiling. It was also able to adapt to the surfaces of smooth glass, rough, sticky or dusty walls as well as various types of metallic materials. It could also identify and circumvent obstacles automatically. Its flexibility and speed were comparable to a natural gecko. A third approach is to mimic the motion of a snake climbing a pole.[41]\n\nSwimming (Piscine)[edit]\nIt is calculated that when swimming some fish can achieve a propulsive efficiency greater than 90%.[108] Furthermore, they can accelerate and maneuver far better than any man-made boat or submarine, and produce less noise and water disturbance. Therefore, many researchers studying underwater robots would like to copy this type of locomotion.[109] Notable examples are the Robotic Fish G9,[110] and Robot Tuna built to analyze and mathematically model thunniform motion.[111] The Aqua Penguin,[112] copies the streamlined shape and propulsion by front \"flippers\" of penguins. The Aqua Ray and Aqua Jelly emulate the locomotion of manta ray, and jellyfish, respectively.\n\n\nRobotic Fish: iSplash-II\nIn 2014, iSplash-II was developed as the first robotic fish capable of outperforming real carangiform fish in terms of average maximum velocity (measured in body lengths/ second) and endurance, the duration that top speed is maintained.[113] This build attained swimming speeds of 11.6BL/s (i.e. 3.7 m/s).[114] The first build, iSplash-I (2014) was the first robotic platform to apply a full-body length carangiform swimming motion which was found to increase swimming speed by 27% over the traditional approach of a posterior confined waveform.[115]\n\nSailing[edit]\nThe autonomous sailboat robot Vaimos\nSailboat robots have also been developed in order to make measurements at the surface of the ocean. A typical sailboat robot is Vaimos.[116] Since the propulsion of sailboat robots uses the wind, the energy of the batteries is only used for the computer, for the communication and for the actuators (to tune the rudder and the sail). If the robot is equipped with solar panels, the robot could theoretically navigate forever. The two main competitions of sailboat robots are WRSC, which takes place every year in Europe, and Sailbot.\n\nComputational robotics areas[edit]\nTOPIO, a humanoid robot, played ping pong at Tokyo IREX 2009.[117]\nControl systems may also have varying levels of autonomy.\n\nDirect interaction is used for haptic or teleoperated devices, and the human has nearly complete control over the robot's motion.\nOperator-assist modes have the operator commanding medium-to-high-level tasks, with the robot automatically figuring out how to achieve them.[118]\nAn autonomous robot may go without human interaction for extended periods of time . Higher levels of autonomy do not necessarily require more complex cognitive capabilities. For example, robots in assembly plants are completely autonomous but operate in a fixed pattern.\nAnother classification takes into account the interaction between human control and the machine motions.\n\nTeleoperation. A human controls each movement, each machine actuator change is specified by the operator.\nSupervisory. A human specifies general moves or position changes and the machine decides specific movements of its actuators.\nTask-level autonomy. The operator specifies only the task and the robot manages itself to complete it.\nFull autonomy. The machine will create and complete all its tasks without human interaction.\nVision[edit]\nMain article: Computer vision\nComputer vision is the science and technology of machines that see. As a scientific discipline, computer vision is concerned with the theory behind artificial systems that extract information from images. The image data can take many forms, such as video sequences and views from cameras.\nIn most practical computer vision applications, the computers are pre-programmed to solve a particular task, but methods based on learning are now becoming increasingly common.\nComputer vision systems rely on image sensors that detect electromagnetic radiation which is typically in the form of either visible light or infra-red light. The sensors are designed using solid-state physics. The process by which light propagates and reflects off surfaces is explained using optics. Sophisticated image sensors even require quantum mechanics to provide a complete understanding of the image formation process. Robots can also be equipped with multiple vision sensors to be better able to compute the sense of depth in the environment. Like human eyes, robots' \"eyes\" must also be able to focus on a particular area of interest, and also adjust to variations in light intensities.\nThere is a subfield within computer vision where artificial systems are designed to mimic the processing and behavior of biological system, at different levels of complexity. Also, some of the learning-based methods developed within computer vision have a background in biology.\n\nEnvironmental interaction and navigation[edit]\nMain articles: Robotic mapping and Robotic navigation\nRadar, GPS, and lidar, are all combined to provide proper navigation and obstacle avoidance (vehicle developed for 2007 DARPA Urban Challenge).\nThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed.  (July 2009) (Learn how and when to remove this message)\nThough a significant percentage of robots in commission today are either human controlled or operate in a static environment, there is an increasing interest in robots that can operate autonomously in a dynamic environment. These robots require some combination of navigation hardware and software in order to traverse their environment. In particular, unforeseen events (e.g. people and other obstacles that are not stationary) can cause problems or collisions. Some highly advanced robots such as ASIMO and Meinü robot have particularly good robot navigation hardware and software. Also, self-controlled cars, Ernst Dickmanns' driverless car, and the entries in the DARPA Grand Challenge, are capable of sensing the environment well and subsequently making navigational decisions based on this information, including by a swarm of autonomous robots.[119] Most of these robots employ a GPS navigation device with waypoints, along with radar, sometimes combined with other sensory data such as lidar, video cameras, and inertial guidance systems for better navigation between waypoints.\n\nHuman-robot interaction[edit]\nMain article: Human-robot interaction\nKismet can produce a range of facial expressions.\nThe state of the art in sensory intelligence for robots will have to progress through several orders of magnitude if we want the robots working in our homes to go beyond vacuum-cleaning the floors. If robots are to work effectively in homes and other non-industrial environments, the way they are instructed to perform their jobs, and especially how they will be told to stop will be of critical importance. The people who interact with them may have little or no training in robotics, and so any interface will need to be extremely intuitive. Science fiction authors also typically assume that robots will eventually be capable of communicating with humans through speech, gestures, and facial expressions, rather than a command-line interface. Although speech would be the most natural way for the human to communicate, it is unnatural for the robot. It will probably be a long time before robots interact as naturally as the fictional C-3PO, or Data of Star Trek, Next Generation. Even though the current state of robotics cannot meet the standards of these robots from science-fiction, robotic media characters (e.g., Wall-E, R2-D2) can elicit audience sympathies that increase people's willingness to accept actual robots in the future.[120] Acceptance of social robots is also likely to increase if people can meet a social robot under appropriate conditions. Studies have shown that interacting with a robot by looking at, touching, or even imagining interacting with the robot can reduce negative feelings that some people have about robots before interacting with them.[121] However, if pre-existing negative sentiments are especially strong, interacting with a robot can increase those negative feelings towards robots.[121]\n\nSpeech recognition[edit]\nMain article: Speech recognition\nInterpreting the continuous flow of sounds coming from a human, in real time, is a difficult task for a computer, mostly because of the great variability of speech.[122] The same word, spoken by the same person may sound different depending on local acoustics, volume, the previous word, whether or not the speaker has a cold, etc.. It becomes even harder when the speaker has a different accent.[123] Nevertheless, great strides have been made in the field since Davis, Biddulph, and Balashek designed the first \"voice input system\" which recognized \"ten digits spoken by a single user with 100% accuracy\" in 1952.[124] Currently, the best systems can recognize continuous, natural speech, up to 160 words per minute, with an accuracy of 95%.[125] With the help of artificial intelligence, machines nowadays can use people's voice to identify their emotions such as satisfied or angry.[126]\n\nRobotic voice[edit]\nOther hurdles exist when allowing the robot to use voice for interacting with humans. For social reasons, synthetic voice proves suboptimal as a communication medium,[127] making it necessary to develop the emotional component of robotic voice through various techniques.[128][129] An advantage of diphonic branching is the emotion that the robot is programmed to project, can be carried on the voice tape, or phoneme, already pre-programmed onto the voice media. One of the earliest examples is a teaching robot named Leachim developed in 1974 by Michael J. Freeman.[130][131] Leachim was able to convert digital memory to rudimentary verbal speech on pre-recorded computer discs.[132] It was programmed to teach students in The Bronx, New York.[132]\n\nFacial expression[edit]\nFurther information: Emotion recognition\nFacial expressions can provide rapid feedback on the progress of a dialog between two humans, and soon may be able to do the same for humans and robots. Robotic faces have been constructed by Hanson Robotics using their elastic polymer called Frubber, allowing a large number of facial expressions due to the elasticity of the rubber facial coating and embedded subsurface motors (servos).[133] The coating and servos are built on a metal skull. A robot should know how to approach a human, judging by their facial expression and body language. Whether the person is happy, frightened, or crazy-looking affects the type of interaction expected of the robot. Likewise, robots like Kismet and the more recent addition, Nexi[134] can produce a range of facial expressions, allowing it to have meaningful social exchanges with humans.[135]\n\nGestures[edit]\nFurther information: Gesture recognition\nOne can imagine, in the future, explaining to a robot chef how to make a pastry, or asking directions from a robot police officer. In both of these cases, making hand gestures would aid the verbal descriptions. In the first case, the robot would be recognizing gestures made by the human, and perhaps repeating them for confirmation. In the second case, the robot police officer would gesture to indicate \"down the road, then turn right\". It is likely that gestures will make up a part of the interaction between humans and robots.[136] A great many systems have been developed to recognize human hand gestures.[137]\n\nProxemics[edit]\nProxemics is the study of personal space, and HRI systems may try to model and work with its concepts for human interactions.\n\nArtificial emotions[edit]\nArtificial emotions can also be generated, composed of a sequence of facial expressions or gestures. As can be seen from the movie Final Fantasy: The Spirits Within, the programming of these artificial emotions is complex and requires a large amount of human observation. To simplify this programming in the movie, presets were created together with a special software program. This decreased the amount of time needed to make the film. These presets could possibly be transferred for use in real-life robots. An example of a robot with artificial emotions is Robin the Robot developed by an Armenian IT company Expper Technologies, which uses AI-based peer-to-peer interaction. Its main task is achieving emotional well-being, i.e. overcome stress and anxiety. Robin was trained to analyze facial expressions and use his face to display his emotions given the context. The robot has been tested by kids in US clinics, and observations show that Robin increased the appetite and cheerfulness of children after meeting and talking.[138]\n\nPersonality[edit]\nMany of the robots of science fiction have a personality, something which may or may not be desirable in the commercial robots of the future.[139] Nevertheless, researchers are trying to create robots which appear to have a personality:[140][141] i.e. they use sounds, facial expressions, and body language to try to convey an internal state, which may be joy, sadness, or fear. One commercial example is Pleo, a toy robot dinosaur, which can exhibit several apparent emotions.[142]\n\nResearch robotics[edit]\nFurther information: Areas of robotics\nMuch of the research in robotics focuses not on specific industrial tasks, but on investigations into new types of robots, alternative ways to think about or design robots, and new ways to manufacture them. Other investigations, such as MIT's cyberflora project, are almost wholly academic.\nTo describe the level of advancement of a robot, the term \"Generation Robots\" can be used. This term is coined by Professor Hans Moravec, Principal Research Scientist at the Carnegie Mellon University Robotics Institute in describing the near future evolution of robot technology. First-generation robots, Moravec predicted in 1997, should have an intellectual capacity comparable to perhaps a lizard and should become available by 2010. Because the first generation robot would be incapable of learning, however, Moravec predicts that the second generation robot would be an improvement over the first and become available by 2020, with the intelligence maybe comparable to that of a mouse. The third generation robot should have intelligence comparable to that of a monkey. Though fourth generation robots, robots with human intelligence, professor Moravec predicts, would become possible, he does not predict this happening before around 2040 or 2050.[143]\n\nDynamics and kinematics[edit]\nFurther information: Kinematics and Dynamics (mechanics)\n.mw-parser-output .infobox-subbox{padding:0;border:none;margin:-3px;width:auto;min-width:100%;font-size:100%;clear:none;float:none;background-color:transparent}.mw-parser-output .infobox-3cols-child{margin:auto}.mw-parser-output .infobox .navbar{font-size:100%}body.skin-minerva .mw-parser-output .infobox-header,body.skin-minerva .mw-parser-output .infobox-subheader,body.skin-minerva .mw-parser-output .infobox-above,body.skin-minerva .mw-parser-output .infobox-title,body.skin-minerva .mw-parser-output .infobox-image,body.skin-minerva .mw-parser-output .infobox-full-data,body.skin-minerva .mw-parser-output .infobox-below{text-align:center}@media screen{html.skin-theme-clientpref-night .mw-parser-output .infobox-full-data:not(.notheme)\u003ediv:not(.notheme)[style]{background:#1f1f23!important;color:#f8f9fa}}@media screen and (prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .infobox-full-data:not(.notheme) div:not(.notheme){background:#1f1f23!important;color:#f8f9fa}}@media(min-width:640px){body.skin--responsive .mw-parser-output .infobox-table{display:table!important}body.skin--responsive .mw-parser-output .infobox-table\u003ecaption{display:table-caption!important}body.skin--responsive .mw-parser-output .infobox-table\u003etbody{display:table-row-group}body.skin--responsive .mw-parser-output .infobox-table tr{display:table-row!important}body.skin--responsive .mw-parser-output .infobox-table th,body.skin--responsive .mw-parser-output .infobox-table td{padding-left:inherit;padding-right:inherit}}External videos How the BB-8 Sphero Toy Works\nThe study of motion can be divided into kinematics and dynamics.[144] Direct kinematics or forward kinematics refers to the calculation of end effector position, orientation, velocity, and acceleration when the corresponding joint values are known. Inverse kinematics refers to the opposite case in which required joint values are calculated for given end effector values, as done in path planning. Some special aspects of kinematics include handling of redundancy (different possibilities of performing the same movement), collision avoidance, and singularity avoidance. Once all relevant positions, velocities, and accelerations have been calculated using kinematics, methods from the field of dynamics are used to study the effect of forces upon these movements. Direct dynamics refers to the calculation of accelerations in the robot once the applied forces are known. Direct dynamics is used in computer simulations of the robot. Inverse dynamics refers to the calculation of the actuator forces necessary to create a prescribed end-effector acceleration. This information can be used to improve the control algorithms of a robot.\nIn each area mentioned above, researchers strive to develop new concepts and strategies, improve existing ones, and improve the interaction between these areas. To do this, criteria for \"optimal\" performance and ways to optimize design, structure, and control of robots must be developed and implemented.\n\nOpen source robotics[edit]\nFurther information: Open source robotics\nOpen source robotics research seeks standards for defining, and methods for designing and building, robots so that they can easily be reproduced by anyone. Research includes legal and technical definitions; seeking out alternative tools and materials to reduce costs and simplify builds; and creating interfaces and standards for designs to work together. Human usability research also investigates how to best document builds through visual, text or video instructions.\n\nEvolutionary robotics[edit]\nEvolutionary robots is a methodology that uses evolutionary computation to help design robots, especially the body form, or motion and behavior controllers. In a similar way to natural evolution, a large population of robots is allowed to compete in some way, or their ability to perform a task is measured using a fitness function. Those that perform worst are removed from the population and replaced by a new set, which have new behaviors based on those of the winners. Over time the population improves, and eventually a satisfactory robot may appear. This happens without any direct programming of the robots by the researchers. Researchers use this method both to create better robots,[145] and to explore the nature of evolution.[146] Because the process often requires many generations of robots to be simulated,[147] this technique may be run entirely or mostly in simulation, using a robot simulator software package, then tested on real robots once the evolved algorithms are good enough.[148] Currently, there are about 10 million industrial robots toiling around the world, and Japan is the top country having high density of utilizing robots in its manufacturing industry.[citation needed]\n\nBionics and biomimetics[edit]\nBionics and biomimetics apply the physiology and methods of locomotion of animals to the design of robots. For example, the design of BionicKangaroo was based on the way kangaroos jump.\n\nSwarm robotics[edit]\nSwarm robotics is an approach to the coordination of multiple robots as a system which consist of large numbers of mostly simple physical robots. ″In a robot swarm, the collective behavior of the robots results from local interactions between the robots and between the robots and the environment in which they act.″* [119]\n\nQuantum computing[edit]\nThere has been some research into whether robotics algorithms can be run more quickly on quantum computers than they can be run on digital computers. This area has been referred to as quantum robotics.[149]\n\nOther research areas[edit]\nNanorobots.\nCobots (collaborative robots).[150]\nAutonomous drones.\nHigh temperature crucibles allow robotic systems to automate sample analysis.[151]\nThe main venues for robotics research are the international conferences ICRA and IROS.\n\nHuman factors[edit]\nEducation and training[edit]\nMain article: Educational robotics\nThe SCORBOT-ER 4u educational robot\nRobotics engineers design robots, maintain them, develop new applications for them, and conduct research to expand the potential of robotics.[152] Robots have become a popular educational tool in some middle and high schools, particularly in parts of the USA,[153] as well as in numerous youth summer camps, raising interest in programming, artificial intelligence, and robotics among students.\n\nEmployment[edit]\nA robot technician builds small all-terrain robots (courtesy: MobileRobots, Inc.).\nMain article: Technological unemployment\nRobotics is an essential component in many modern manufacturing environments. As factories increase their use of robots, the number of robotics–related jobs grow and have been observed to be steadily rising.[154] The employment of robots in industries has increased productivity and efficiency savings and is typically seen as a long-term investment for benefactors. A study found that 47 percent of US jobs are at risk to automation \"over some unspecified number of years\".[155] These claims have been criticized on the ground that social policy, not AI, causes unemployment.[156] In a 2016 article in The Guardian, Stephen Hawking stated \"The automation of factories has already decimated jobs in traditional manufacturing, and the rise of artificial intelligence is likely to extend this job destruction deep into the middle classes, with only the most caring, creative or supervisory roles remaining\".[157]   The rise of robotics is thus often used as an argument for universal basic income.\nAccording to a GlobalData September 2021 report, the robotics industry was worth $45bn in 2020, and by 2030, it will have grown at a compound annual growth rate (CAGR) of 29% to $568bn, driving jobs in robotics and related industries.[158]\n\nOccupational safety and health implications[edit]\nMain article: Workplace robotics safety\nA discussion paper drawn up by EU-OSHA highlights how the spread of robotics presents both opportunities and challenges for occupational safety and health (OSH).[159]\nThe greatest OSH benefits stemming from the wider use of robotics should be substitution for people working in unhealthy or dangerous environments. In space, defense, security, or the nuclear industry, but also in logistics, maintenance, and inspection, autonomous robots are particularly useful in replacing human workers performing dirty, dull or unsafe tasks, thus avoiding workers' exposures to hazardous agents and conditions and reducing physical, ergonomic and psychosocial risks. For example, robots are already used to perform repetitive and monotonous tasks, to handle radioactive material or to work in explosive atmospheres. In the future, many other highly repetitive, risky or unpleasant tasks will be performed by robots in a variety of sectors like agriculture, construction, transport, healthcare, firefighting or cleaning services.[160]\nMoreover, there are certain skills to which humans will be better suited than machines for some time to come and the question is how to achieve the best combination of human and robot skills. The advantages of robotics include heavy-duty jobs with precision and repeatability, whereas the advantages of humans include creativity, decision-making, flexibility, and adaptability. This need to combine optimal skills has resulted in collaborative robots and humans sharing a common workspace more closely and led to the development of new approaches and standards to guarantee the safety of the \"man-robot merger\". Some European countries are including robotics in their national programs and trying to promote a safe and flexible cooperation between robots and operators to achieve better productivity. For example, the German Federal Institute for Occupational Safety and Health (BAuA) organises annual workshops on the topic \"human-robot collaboration\".\nIn the future, cooperation between robots and humans will be diversified, with robots increasing their autonomy and human-robot collaboration reaching completely new forms. Current approaches and technical standards[161][162] aiming to protect employees from the risk of working with collaborative robots will have to be revised.\n\nUser experience[edit]\nGreat user experience predicts the needs, experiences, behaviors, language and cognitive abilities, and other factors of each user group. It then uses these insights to produce a product or solution that is ultimately useful and usable. For robots, user experience begins with an understanding of the robot's intended task and environment, while considering any possible social impact the robot may have on human operations and interactions with it.[163]\nIt defines that communication as the transmission of information through signals, which are elements perceived through touch, sound, smell and sight.[164] The author states that the signal connects the sender to the receiver and consists of three parts: the signal itself, what it refers to, and the interpreter. Body postures and gestures, facial expressions, hand and head movements are all part of nonverbal behavior and communication. Robots are no exception when it comes to human-robot interaction. Therefore, humans use their verbal and nonverbal behaviors to communicate their defining characteristics. Similarly, social robots need this coordination to perform human-like behaviors.\n\nCareers[edit]\nRobotics is an interdisciplinary field, combining primarily mechanical engineering and computer science but also drawing on electronic engineering and other subjects. The usual way to build a career in robotics is to complete an undergraduate degree in one of these established subjects, followed by a graduate (masters') degree in Robotics. Graduate degrees are typically joined by students coming from all of the contributing disciplines, and include familiarization of relevant undergraduate level subject matter from each of them, followed by specialist study in pure robotics topics which build upon them. As an interdisciplinary subject, robotics graduate programmes tend to be especially reliant on students working and learning together and sharing their knowledge and skills from their home discipline first degrees.\nRobotics industry careers then follow the same pattern, with most roboticists working as part of interdisciplinary teams of specialists from these home disciplines followed by the robotics graduate degrees which enable them to work together. Workers typically continue to identify as members of their home disciplines who work in robotics, rather than as 'roboticists'. This structure is reinforced by the nature of some engineering professions, which grant chartered engineer status to members of home disciplines rather than to robotics as a whole.\nRobotics careers are widely predicted to grow in the 21st century, as robots replace more manual and intellectual human work. Some workers who lose their jobs to robotics may be well-placed to retrain to build and maintain these robots, using their domain-specific knowledge and skills.\n\nHistory[edit]\nSee also: History of robots\n\n\n\nDate\n\nSignificance\n\nRobot name\n\nInventor\n\n\nc. 420 B.C.\n\nA wooden, steam-propelled bird, which was able to fly\n\nFlying pigeon\n\nArchytas of Tarentum\n\n\nThird century B.C. and earlier\n\nOne of the earliest descriptions of automata appears in the Lie Zi text, on a much earlier encounter between King Mu of Zhou (1023–957 BC) and a mechanical engineer known as Yan Shi, an 'artificer'. The latter allegedly presented the king with a life-size, human-shaped figure of his mechanical handiwork.[165]\n\n\n\nYan Shi (Chinese: 偃师)\n\n\nFirst century A.D. and earlier\n\nDescriptions of more than 100 machines and automata, including a fire engine, a wind organ, a coin-operated machine, and a steam-powered engine, in Pneumatica and Automata by Heron of Alexandria\n\n\n\nCtesibius, Philo of Byzantium, Heron of Alexandria, and others\n\n\n1206\n\nCreated early humanoid automata, programmable automaton band[166]Robot band, hand-washing automaton,[167] automated moving peacocks[168]\n\n\n\nAl-Jazari\n\n\n1495\n\nDesigns for a humanoid robot\n\nMechanical Knight\n\nLeonardo da Vinci\n\n\n1560s\n\nClockwork Prayer that had machinal feet built under its robes that imitated walking. The robot's eyes, lips, and head all move in lifelike gestures.\n\nClockwork Prayer[citation needed]\n\nGianello della Torre\n\n\n1738\n\nMechanical duck that was able to eat, flap its wings, and excrete\n\nDigesting Duck\n\nJacques de Vaucanson\n\n\n1898\n\nNikola Tesla demonstrates the first radio-controlled vessel.\n\nTeleautomaton\n\nNikola Tesla\n\n\n\n1903\n\nLeonardo Torres Quevedo presented the Telekino at the Paris Academy of Science, a radio-based control system with different operational states, for testing airships without risking human lives.[169] He conduct the initial test controlling a tricycle almost 100 feet away, being the first example of a radio-controlled unmanned ground vehicle.[170][171]\n\nTelekino\n\nLeonardo Torres Quevedo\n\n\n1912\n\nLeonardo Torres Quevedo builds the first truly autonomous machine capable of playing chess. As opposed to the human-operated The Turk and Ajeeb, El Ajedrecista had an integrated automaton built to play chess without human guidance. It only played an endgame with three chess pieces, automatically moving a white king and a rook to checkmate the black king moved by a human opponent.[172][173]\n\nEl Ajedrecista\n\nLeonardo Torres Quevedo\n\n\n1914\n\nIn his paper Essays on Automatics published in 1914, Leonardo Torres Quevedo proposed a machine that makes \"judgments\" using sensors that capture information from the outside, parts that manipulate the outside world like arms, power sources such as batteries and air pressure, and most importantly, captured information and past information. It was defined as an organism that can control reactions in response to external information and adapt to changes in the environment to change its behavior.[174][175][176][177]\n\nEssays on Automatics\n\nLeonardo Torres Quevedo\n\n\n1921\n\nFirst fictional automatons called \"robots\" appear in the play R.U.R.\n\nRossum's Universal Robots\n\nKarel Čapek\n\n\n1930s\n\nHumanoid robot exhibited at the 1939 and 1940 World's Fairs\n\nElektro\n\nWestinghouse Electric Corporation\n\n\n1946\n\nFirst general-purpose digital computer\n\nWhirlwind\n\nMultiple people\n\n\n1948\n\nSimple robots exhibiting biological behaviors[178]\n\nElsie and Elmer\n\nWilliam Grey Walter\n\n\n1948\n\nFormulation of principles of cybernetics\n\ncybernetics\n\nNorbert Wiener\n\n\n1956\n\nFirst commercial robot, from the Unimation company founded by George Devol and Joseph Engelberger, based on Devol's patents[179]\n\nUnimate\n\nGeorge Devol\n\n\n1961\n\nFirst installed industrial robot.  The first digitally operated and programmable robot, Unimate, was installed in 1961 to lift hot pieces of metal from a die casting machine and stack them.\n\nUnimate\n\nGeorge Devol\n\n\n1967 to 1972\n\nFirst full-scale humanoid intelligent robot,[180][181] and first android. Its limb control system allowed it to walk with the lower limbs, and to grip and transport objects with its hands, using tactile sensors. Its vision system allowed it to measure distances and directions to objects using external receptors, artificial eyes, and ears. And its conversation system allowed it to communicate with a person in Japanese, with an artificial mouth.[182][183][184]\n\nWABOT-1\n\nWaseda University\n\n\n1973\n\nFirst industrial robot with six electromechanically driven axes[185][186]\n\nFamulus\n\nKUKA Robot Group\n\n\n1974\n\nThe world's first microcomputer controlled electric industrial robot, IRB 6 from ASEA, was delivered to a small mechanical engineering company in southern Sweden. The design of this robot had been patented in 1972.\n\nIRB 6\n\nABB Robot Group\n\n\n1975\n\nProgrammable universal manipulation arm, a Unimation product\n\nPUMA\n\nVictor Scheinman\n\n\n1978\n\nThe first object-level robot programming language, RAPT, allowing robots to handle variations in object position, shape, and sensor noise.[187]\n\nFreddy I and II\n\nPatricia Ambler and Robin Popplestone\n\n\n1983\n\nFirst multitasking, the parallel programming language used for robot control. It was the Event Driven Language (EDL) on the IBM/Series/1 process computer, with the implementation of both inter-process communication (WAIT/POST) and mutual exclusion (ENQ/DEQ) mechanisms for robot control.[188]\n\nADRIEL I\n\nStevo Bozinovski and Mihail Sestakov\n\n\nSee also[edit]\n.mw-parser-output .div-col{margin-top:0.3em;column-width:30em}.mw-parser-output .div-col-small{font-size:90%}.mw-parser-output .div-col-rules{column-rule:1px solid #aaa}.mw-parser-output .div-col dl,.mw-parser-output .div-col ol,.mw-parser-output .div-col ul{margin-top:0}.mw-parser-output .div-col li,.mw-parser-output .div-col dd{page-break-inside:avoid;break-inside:avoid-column}\nArtificial intelligence\nAutonomous robot\nCloud robotics\nCognitive robotics\nEvolutionary robotics\nFog robotics\nGlossary of robotics\nIndex of robotics articles\nMechatronics\nMulti-agent system\nOutline of robotics\nQuantum robotics\nRoboethics\nRobot rights\nRobotic art\nRobotic governance\nSelf-reconfiguring modular robot\nSoft robotics\nTelerobotics\n\nNotes[edit]\n.mw-parser-output .reflist{margin-bottom:0.5em;list-style-type:decimal}@media screen{.mw-parser-output .reflist{font-size:90%}}.mw-parser-output .reflist .references{font-size:100%;margin-bottom:0;list-style-type:inherit}.mw-parser-output .reflist-columns-2{column-width:30em}.mw-parser-output .reflist-columns-3{column-width:25em}.mw-parser-output .reflist-columns{margin-top:0.3em}.mw-parser-output .reflist-columns ol{margin-top:0}.mw-parser-output .reflist-columns li{page-break-inside:avoid;break-inside:avoid-column}.mw-parser-output .reflist-upper-alpha{list-style-type:upper-alpha}.mw-parser-output .reflist-upper-roman{list-style-type:upper-roman}.mw-parser-output .reflist-lower-alpha{list-style-type:lower-alpha}.mw-parser-output .reflist-lower-greek{list-style-type:lower-greek}.mw-parser-output .reflist-lower-roman{list-style-type:lower-roman}\n\n^ One database, developed by the United States Department of Energy, contains information on almost 500 existing robotic technologies.[10]\n\n\nReferences[edit]\n\n\n^ .mw-parser-output cite.citation{font-style:inherit;word-wrap:break-word}.mw-parser-output .citation q{quotes:\"\\\"\"\"\\\"\"\"'\"\"'\"}.mw-parser-output .citation:target{background-color:rgba(0,127,255,0.133)}.mw-parser-output .id-lock-free.id-lock-free a{background:url(\"//upload.wikimedia.org/wikipedia/commons/6/65/Lock-green.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-limited.id-lock-limited a,.mw-parser-output .id-lock-registration.id-lock-registration a{background:url(\"//upload.wikimedia.org/wikipedia/commons/d/d6/Lock-gray-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-subscription.id-lock-subscription a{background:url(\"//upload.wikimedia.org/wikipedia/commons/a/aa/Lock-red-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .cs1-ws-icon a{background:url(\"//upload.wikimedia.org/wikipedia/commons/4/4c/Wikisource-logo.svg\")right 0.1em center/12px no-repeat}body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-free a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-limited a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-registration a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-subscription a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .cs1-ws-icon a{background-size:contain;padding:0 1em 0 0}.mw-parser-output .cs1-code{color:inherit;background:inherit;border:none;padding:inherit}.mw-parser-output .cs1-hidden-error{display:none;color:var(--color-error,#d33)}.mw-parser-output .cs1-visible-error{color:var(--color-error,#d33)}.mw-parser-output .cs1-maint{display:none;color:#085;margin-left:0.3em}.mw-parser-output .cs1-kern-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right{padding-right:0.2em}.mw-parser-output .citation .mw-selflink{font-weight:inherit}@media screen{.mw-parser-output .cs1-format{font-size:95%}html.skin-theme-clientpref-night .mw-parser-output .cs1-maint{color:#18911f}}@media screen and (prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .cs1-maint{color:#18911f}}\"German National Library\". International classification system of the German National Library (GND). Archived from the original on 2020-08-19.\n\n^ \"Origami-Inspired Robots Can Sense, Analyze and Act in Challenging Environments\". UCLA. Retrieved 2023-04-10.\n\n^ Raj, Aditi (26 August 2024). \"AI \u0026 Robotics: The Role of AI in Robots\". Retrieved 2024-08-29.\n\n^ Hunt, V. Daniel (1985). \"Smart Robots\". Smart Robots: A Handbook of Intelligent Robotic Systems. Chapman and Hall. p. 141. ISBN 978-1-4613-2533-8. Archived from the original on 2023-03-15. Retrieved 2018-12-04.\n\n^ \"Robot density rises globally\". Robotic Industries Association. 8 February 2018. Archived from the original on 2020-11-23. Retrieved 2018-12-03.\n\n^ Pinto, Jim (1 October 2003). \"Fully automated factories approach reality\". Automation World. Archived from the original on 2011-10-01. Retrieved 2018-12-03.\n\n^ Eyre, Michael (12 September 2014). \"'Boris' the robot can load up dishwasher\". BBC News. Archived from the original on 2020-12-21. Retrieved 2018-12-03.\n\n^ Corner, Stuart (23 November 2017). \"AI-driven robot makes 'perfect' flatbread\". iothub.com.au. Archived from the original on 2020-11-24. Retrieved 2018-12-03.\n\n^ Pollock, Emily (7 June 2018). \"Construction Robotics Industry Set to Double by 2023\". engineering.com. Archived from the original on 2020-08-07. Retrieved 2018-12-03.\n\n^ \"Technology Advanced Search\". D\u0026D Knowledge Management Information Tool. Archived from the original on 2020-08-06.\n\n^ Arámbula Cosío, F.; Hibberd, R. D.; Davies, B. L. (July 1997). \"Electromagnetic compatibility aspects of active robotic systems for surgery: the robotic prostatectomy experience\". Medical and Biological Engineering and Computing. 35 (4): 436–440. doi:10.1007/BF02534105. ISSN 1741-0444. PMID 9327627. S2CID 21479700.\n\n^ Grift, Tony E. (2004). \"Agricultural Robotics\". University of Illinois at Urbana–Champaign. Archived from the original on 2007-05-04. Retrieved 2018-12-03.\n\n^ Thomas, Jim (1 November 2017). \"How corporate giants are automating the farm\". New Internationalist. Archived from the original on 2021-01-10. Retrieved 2018-12-03.\n\n^ Kolodny, Lora (4 July 2017). \"Robots are coming to a burger joint near you\". CNBC. Archived from the original on 2020-12-05. Retrieved 2018-12-03.\n\n^ Scott Kirsner (27 January 2023). \"Robots in the kitchen? Local engineers are making it a reality\". The Boston Globe.\n\n^ Dowling, Kevin. \"Power Sources for Small Robots\" (PDF). Carnegie Mellon University. Archived (PDF) from the original on 2020-11-25. Retrieved 2012-05-11.\n\n^ Roozing, Wesley; Li, Zhibin; Tsagarakis, Nikos; Caldwell, Darwin (2016). \"Design Optimisation and Control of Compliant Actuation Arrangements in Articulated Robots for Improved Energy Efficiency\". IEEE Robotics and Automation Letters. 1 (2): 1110–1117. doi:10.1109/LRA.2016.2521926. S2CID 1940410.\n\n^ Pratt, G.A.; Williamson, M.M. (1995). \"Series elastic actuators\". Proceedings 1995 IEEE/RSJ International Conference on Intelligent Robots and Systems. Human-Robot Interaction and Cooperative Robots. Vol. 1. pp. 399–406. doi:10.1109/IROS.1995.525827. hdl:1721.1/36966. ISBN 0-8186-7108-4. S2CID 17120394.\n\n^ Furnémont, Raphaël; Mathijssen, Glenn; Verstraten, Tom; Lefeber, Dirk; Vanderborght, Bram (27 January 2016). \"Bi-directional series-parallel elastic actuator and overlap of the actuation layers\" (PDF). Bioinspiration \u0026 Biomimetics. 11 (1): 016005. Bibcode:2016BiBi...11a6005F. doi:10.1088/1748-3190/11/1/016005. PMID 26813145. S2CID 37031990. Archived (PDF) from the original on 2022-10-01. Retrieved 2023-03-15.\n\n^ Pratt, Jerry E.; Krupp, Benjamin T. (2004). \"Series Elastic Actuators for legged robots\". In Gerhart, Grant R; Shoemaker, Chuck M; Gage, Douglas W (eds.). Unmanned Ground Vehicle Technology VI. Vol. 5422. pp. 135–144. doi:10.1117/12.548000. S2CID 16586246.\n\n^ Li, Zhibin; Tsagarakis, Nikos; Caldwell, Darwin (2013). \"Walking Pattern Generation for a Humanoid Robot with Compliant Joints\". Autonomous Robots. 35 (1): 1–14. doi:10.1007/s10514-013-9330-7. S2CID 624563.\n\n^ Colgate, J. Edward (1988). The control of dynamically interacting systems (Thesis). hdl:1721.1/14380.\n\n^ Calanca, Andrea; Muradore, Riccardo; Fiorini, Paolo (November 2017). \"Impedance control of series elastic actuators: Passivity and acceleration-based control\". Mechatronics. 47: 37–48. doi:10.1016/j.mechatronics.2017.08.010.\n\n^ Tosun, Fatih Emre; Patoglu, Volkan (June 2020). \"Necessary and Sufficient Conditions for the Passivity of Impedance Rendering With Velocity-Sourced Series Elastic Actuation\". IEEE Transactions on Robotics. 36 (3): 757–772. doi:10.1109/TRO.2019.2962332. S2CID 212907787.\n\n^ www.imagesco.com, Images SI Inc -. \"Air Muscle actuators, going further, page 6\". Archived from the original on 2020-11-14. Retrieved 2010-05-24.\n\n^ \"Air Muscles\". Shadow Robot. Archived from the original on 2007-09-27.\n\n^ Tondu, Bertrand (2012). \"Modelling of the McKibben artificial muscle: A review\". Journal of Intelligent Material Systems and Structures. 23 (3): 225–253. doi:10.1177/1045389X11435435. S2CID 136854390.\n\n^ \"TALKING ELECTRONICS Nitinol Page-1\". Talkingelectronics.com. Archived from the original on 2020-01-18. Retrieved 2010-11-27.\n\n^ \"lf205, Hardware: Building a Linux-controlled walking robot\". Ibiblio.org. 1 November 2001. Archived from the original on 2016-03-03. Retrieved 2010-11-27.\n\n^ \"WW-EAP and Artificial Muscles\". Eap.jpl.nasa.gov. Archived from the original on 2017-01-20. Retrieved 2010-11-27.\n\n^ \"Empa – a117-2-eap\". Empa.ch. Archived from the original on 2015-09-24. Retrieved 2010-11-27.\n\n^ \"Electroactive Polymers (EAP) as Artificial Muscles (EPAM) for Robot Applications\". Hizook. Archived from the original on 2020-08-06. Retrieved 2010-11-27.\n\n^ \"Piezo LEGS – -09-26\". Archived from the original on 2008-01-30. Retrieved 2007-10-28.\n\n^ \"Squiggle Motors: Overview\". Archived from the original on 2007-10-07. Retrieved 2007-10-08.\n\n^ Nishibori; et al. (2003). \"Robot Hand with Fingers Using Vibration-Type Ultrasonic Motors (Driving Characteristics)\". Journal of Robotics and Mechatronics. 15 (6): 588–595. doi:10.20965/jrm.2003.p0588.\n\n^ Otake, Mihoko; Kagami, Yoshiharu; Ishikawa, Kohei; Inaba, Masayuki; Inoue, Hirochika (6 April 2001). Wilson, Alan R.; Asanuma, Hiroshi (eds.). \"Shape design of gel robots made of electroactive polymer gel\". Smart Materials. 4234: 194–202. Bibcode:2001SPIE.4234..194O. doi:10.1117/12.424407. S2CID 30357330.\n\n^ Madden, John D. (16 November 2007). \"Mobile Robots: Motor Challenges and Materials Solutions\". Science. 318 (5853): 1094–1097. Bibcode:2007Sci...318.1094M. CiteSeerX 10.1.1.395.4635. doi:10.1126/science.1146351. PMID 18006737. S2CID 52827127.\n\n^ \"Syntouch LLC: BioTac(R) Biomimetic Tactile Sensor Array\". Archived from the original on 2009-10-03. Retrieved 2009-08-10.\n\n^ Wettels, Nicholas; Santos, Veronica J.; Johansson, Roland S.; Loeb, Gerald E. (January 2008). \"Biomimetic Tactile Sensor Array\". Advanced Robotics. 22 (8): 829–849. doi:10.1163/156855308X314533. S2CID 4594917.\n\n^ \"What is The SmartHand?\". SmartHand Project. Archived from the original on 2015-03-03. Retrieved 2011-02-04.\n\n^ a b Arreguin, Juan (2008). Automation and Robotics. Vienna, Austria: I-Tech and Publishing.\n\n^ \"Annotated Mythbusters: Episode 78: Ninja Myths – Walking on Water, Catching a Sword, Catching an Arrow\". Archived from the original on 2020-11-12. Retrieved 2010-02-13. (Discovery Channel's Mythbusters making mechanical gripper from the chain and metal wire)\n\n^ \"Robonaut hand\". Archived from the original on 2020-02-22. Retrieved 2011-11-21.\n\n^ \"Delft hand\". TU Delft. Archived from the original on 2012-02-03. Retrieved 2011-11-21.\n\n^ M\u0026C. \"TU Delft ontwikkelt goedkope, voorzichtige robothand\". Archived from the original on 2017-03-13. Retrieved 2011-11-21.\n\n^ \"astrictive definition – English definition dictionary – Reverso\". Archived from the original on 2020-04-30. Retrieved 2008-01-06.\n\n^ Tijsma, H.A.; Liefhebber, F.; Herder, J.L. (2005). \"Evaluation of New User Interface Features for the MANUS Robot Arm\". 9th International Conference on Rehabilitation Robotics, 2005. ICORR 2005. pp. 258–263. doi:10.1109/ICORR.2005.1501097. ISBN 0-7803-9003-2. S2CID 36445389.\n\n^ Allcock, Andrew (2006). \"Anthropomorphic hand is almost human\". Machinery. Archived from the original on 2007-09-28. Retrieved 2007-10-17.\n\n^ \"Welcome\". Archived (PDF) from the original on 2013-05-10. Retrieved 2007-10-28.\n\n^ a b c Corke, Peter (2017). Robotics, Vision and Control. Springer Tracts in Advanced Robotics. Vol. 118. doi:10.1007/978-3-319-54413-7. ISBN 978-3-319-54412-0. ISSN 1610-7438. Archived from the original on 2022-10-20. Retrieved 2023-03-15.\n\n^ a b c Lee, K. S. Fu, Ralph Gonzalez, C S. G. (1987). Robotics: Control Sensing. Vis. McGraw-Hill. ISBN 978-0-07-026510-3. Archived from the original on 2023-03-15. Retrieved 2023-03-15.{{cite book}}:  CS1 maint: multiple names: authors list (link)\n\n^ a b c d Short, Michael; Burn, Kevin (1 April 2011). \"A generic controller architecture for intelligent robotic systems\". Robotics and Computer-Integrated Manufacturing. 27 (2): 292–305. doi:10.1016/j.rcim.2010.07.013. ISSN 0736-5845.\n\n^ Ray, Partha Pratim (2016). \"Internet of Robotic Things: Concept, Technologies, and Challenges\". IEEE Access. 4: 9489–9500. Bibcode:2016IEEEA...4.9489R. doi:10.1109/ACCESS.2017.2647747. ISSN 2169-3536. S2CID 9273802.\n\n^ a b Burn, K.; Short, M.; Bicker, R. (July 2003). \"Adaptive and Nonlinear Fuzzy Force Control Techniques Applied to Robots Operating in Uncertain Environments\". Journal of Robotic Systems. 20 (7): 391–400. doi:10.1002/rob.10093. ISSN 0741-2223. Archived from the original on 2022-11-26. Retrieved 2023-03-15.\n\n^ Burn, Kevin; Home, Geoffrey (1 May 2008). \"Environment classification using Kohonen self-organizing maps\". Expert Systems. 25 (2): 98–114. doi:10.1111/j.1468-0394.2008.00441.x. ISSN 0266-4720. S2CID 33369232.\n\n^ Mason, Matthew T. (2001). Mechanics of Robotic Manipulation. doi:10.7551/mitpress/4527.001.0001. ISBN 9780262256629. S2CID 5260407.\n\n^ \"What is a robotic end-effector?\". ATI Industrial Automation. 2007. Archived from the original on 2020-12-17. Retrieved 2007-10-16.\n\n^ Crane, Carl D.; Joseph Duffy (1998). Kinematic Analysis of Robot Manipulators. Cambridge University Press. ISBN 978-0-521-57063-3. Archived from the original on 2020-04-02. Retrieved 2007-10-16.\n\n^ G.J. Monkman, S. Hesse, R. Steinmann \u0026 H. Schunk (2007). Robot Grippers. Berlin: Wiley\n\n^ \"T.O.B.B\". Mtoussaint.de. Archived from the original on 2020-07-08. Retrieved 2010-11-27.\n\n^ \"nBot, a two wheel balancing robot\". Geology.heroy.smu.edu. Archived from the original on 2021-01-26. Retrieved 2010-11-27.\n\n^ \"ROBONAUT Activity Report\". NASA. 2004. Archived from the original on 2007-08-20. Retrieved 2007-10-20.\n\n^ Guizzo, Erico (29 April 2010). \"A Robot That Balances on a Ball\". IEEE Spectrum. Archived from the original on 2023-02-10. Retrieved 2023-03-15.\n\n^ \"Carnegie Mellon Researchers Develop New Type of Mobile Robot That Balances and Moves on a Ball Instead of Legs or Wheels\" (Press release). Carnegie Mellon. 9 August 2006. Archived from the original on 2007-06-09. Retrieved 2007-10-20.\n\n^ \"Spherical Robot Can Climb Over Obstacles\". BotJunkie. Archived from the original on 2012-03-28. Retrieved 2010-11-27.\n\n^ \"Rotundus\". Rotundus.se. Archived from the original on 2011-08-26. Retrieved 2010-11-27.\n\n^ \"OrbSwarm Gets A Brain\". BotJunkie. 11 July 2007. Archived from the original on 2012-05-16. Retrieved 2010-11-27.\n\n^ \"Rolling Orbital Bluetooth Operated Thing\". BotJunkie. Archived from the original on 2012-03-28. Retrieved 2010-11-27.\n\n^ \"Swarm\". Orbswarm.com. Archived from the original on 2021-01-26. Retrieved 2010-11-27.\n\n^ \"The Ball Bot : Johnnytronic@Sun\". Blogs.sun.com. Archived from the original on 2011-08-24. Retrieved 2010-11-27.\n\n^ \"Senior Design Projects | College of Engineering \u0026 Applied Science| University of Colorado at Boulder\". Engineering.colorado.edu. 30 April 2008. Archived from the original on 2011-07-23. Retrieved 2010-11-27.\n\n^ \"JPL Robotics: System: Commercial Rovers\". Archived from the original on 2006-06-15.\n\n^ \"AMBER Lab\". Archived from the original on 2020-11-25. Retrieved 2012-01-23.\n\n^ \"Micromagic Systems Robotics Lab\". Archived from the original on 2017-06-01. Retrieved 2009-04-29.\n\n^ \"AMRU-5 hexapod robot\" (PDF). Archived (PDF) from the original on 2016-08-17. Retrieved 2009-04-29.\n\n^ \"Achieving Stable Walking\". Honda Worldwide. Archived from the original on 2011-11-08. Retrieved 2007-10-22.\n\n^ \"Funny Walk\". Pooter Geek. 28 December 2004. Archived from the original on 2011-09-28. Retrieved 2007-10-22.\n\n^ \"ASIMO's Pimp Shuffle\". Popular Science. 9 January 2007. Archived from the original on 2011-07-24. Retrieved 2007-10-22.\n\n^ \"Robot Shows Prime Minister How to Loosen Up \u003e \u003e A drunk robot?\". The Temple of VTEC – Honda and Acura Enthusiasts Online Forums. 25 August 2003. Archived from the original on 2020-04-30.\n\n^ \"3D One-Leg Hopper (1983–1984)\". MIT Leg Laboratory. Archived from the original on 2018-07-25. Retrieved 2007-10-22.\n\n^ \"3D Biped (1989–1995)\". MIT Leg Laboratory. Archived from the original on 2011-09-26. Retrieved 2007-10-28.\n\n^ \"Quadruped (1984–1987)\". MIT Leg Laboratory. Archived from the original on 2011-08-23. Retrieved 2007-10-28.\n\n^ \"MIT Leg Lab Robots- Main\". Archived from the original on 2020-08-07. Retrieved 2007-10-28.\n\n^ \"About the Robots\". Anybots. Archived from the original on 2007-09-09. Retrieved 2007-10-23.\n\n^ \"Anything, Anytime, Anywhere\". Anybots. Archived from the original on 2007-10-27. Retrieved 2007-10-23.\n\n^ \"Dexter Jumps video\". YouTube. 1 March 2007. Archived from the original on 2021-10-30. Retrieved 2007-10-23.\n\n^ Collins, Steve; Ruina, Andy; Tedrake, Russ; Wisse, Martijn (18 February 2005). \"Efficient Bipedal Robots Based on Passive-Dynamic Walkers\". Science. 307 (5712): 1082–1085. Bibcode:2005Sci...307.1082C. doi:10.1126/science.1107799. PMID 15718465. S2CID 1315227.\n\n^ Collins, S.H.; Ruina, A. (2005). \"A Bipedal Walking Robot with Efficient and Human-Like Gait\". Proceedings of the 2005 IEEE International Conference on Robotics and Automation. pp. 1983–1988. doi:10.1109/ROBOT.2005.1570404. ISBN 0-7803-8914-X. S2CID 15145353.\n\n^ \"Testing the Limits\" (PDF). Boeing. p. 29. Archived (PDF) from the original on 2018-12-15. Retrieved 2008-04-09.\n\n^ Zhang, Jun; Zhao, Ning; Qu, Feiyang (15 November 2022). \"Bio-inspired flapping wing robots with foldable or deformable wings: a review\". Bioinspiration \u0026 Biomimetics. 18 (1): 011002. doi:10.1088/1748-3190/ac9ef5. ISSN 1748-3182. PMID 36317380. S2CID 253246037.\n\n^ a b c Shin, Won Dong; Park, Jaejun; Park, Hae-Won (1 September 2019). \"Development and experiments of a bio-inspired robot with multi-mode in aerial and terrestrial locomotion\". Bioinspiration \u0026 Biomimetics. 14 (5): 056009. Bibcode:2019BiBi...14e6009S. doi:10.1088/1748-3190/ab2ab7. ISSN 1748-3182. PMID 31212268. S2CID 195066183.\n\n^ Ramezani, Alireza; Shi, Xichen; Chung, Soon-Jo; Hutchinson, Seth (May 2016). \"Bat Bot (B2), a biologically inspired flying machine\". 2016 IEEE International Conference on Robotics and Automation (ICRA). Stockholm, Sweden: IEEE. pp. 3219–3226. doi:10.1109/ICRA.2016.7487491. ISBN 978-1-4673-8026-3. S2CID 8581750.\n\n^ a b Daler, Ludovic; Mintchev, Stefano; Stefanini, Cesare; Floreano, Dario (19 January 2015). \"A bioinspired multi-modal flying and walking robot\". Bioinspiration \u0026 Biomimetics. 10 (1): 016005. Bibcode:2015BiBi...10a6005D. doi:10.1088/1748-3190/10/1/016005. ISSN 1748-3190. PMID 25599118. S2CID 11132948.\n\n^ a b Kilian, Lukas; Shahid, Farzeen; Zhao, Jing-Shan; Nayeri, Christian Navid (1 July 2022). \"Bioinspired morphing wings: mechanical design and wind tunnel experiments\". Bioinspiration \u0026 Biomimetics. 17 (4): 046019. Bibcode:2022BiBi...17d6019K. doi:10.1088/1748-3190/ac72e1. ISSN 1748-3182. PMID 35609562. S2CID 249045806.\n\n^ Savastano, E.; Perez-Sanchez, V.; Arrue, B.C.; Ollero, A. (July 2022). \"High-Performance Morphing Wing for Large-Scale Bio-Inspired Unmanned Aerial Vehicles\". IEEE Robotics and Automation Letters. 7 (3): 8076–8083. doi:10.1109/LRA.2022.3185389. ISSN 2377-3766. S2CID 250008824.\n\n^ Grant, Daniel T.; Abdulrahim, Mujahid; Lind, Rick (June 2010). \"Flight Dynamics of a Morphing Aircraft Utilizing Independent Multiple-Joint Wing Sweep\". International Journal of Micro Air Vehicles. 2 (2): 91–106. doi:10.1260/1756-8293.2.2.91. ISSN 1756-8293. S2CID 110577545.\n\n^ Phan, Hoang Vu; Park, Hoon Cheol (4 December 2020). \"Mechanisms of collision recovery in flying beetles and flapping-wing robots\". Science. 370 (6521): 1214–1219. Bibcode:2020Sci...370.1214P. doi:10.1126/science.abd3285. ISSN 0036-8075. PMID 33273101. S2CID 227257247.\n\n^ Hu, Zheng; McCauley, Raymond; Schaeffer, Steve; Deng, Xinyan (May 2009). \"Aerodynamics of dragonfly flight and robotic design\". 2009 IEEE International Conference on Robotics and Automation. pp. 3061–3066. doi:10.1109/ROBOT.2009.5152760. ISBN 978-1-4244-2788-8. S2CID 12291429.\n\n^ Balta, Miquel; Deb, Dipan; Taha, Haithem E (26 October 2021). \"Flow visualization and force measurement of the clapping effect in bio-inspired flying robots\". Bioinspiration \u0026 Biomimetics. 16 (6): 066020. Bibcode:2021BiBi...16f6020B. doi:10.1088/1748-3190/ac2b00. ISSN 1748-3182. PMID 34584023. S2CID 238217893.\n\n^ Miller, Gavin. \"Introduction\". snakerobots.com. Archived from the original on 2011-08-17. Retrieved 2007-10-22.\n\n^ \"ACM-R5\". Archived from the original on 2011-10-11.\n\n^ \"Swimming snake robot (commentary in Japanese)\". Archived from the original on 2012-02-08. Retrieved 2007-10-28.\n\n^ \"Commercialized Quadruped Walking Vehicle \"TITAN VII\"\". Hirose Fukushima Robotics Lab. Archived from the original on 2007-11-06. Retrieved 2007-10-23.\n\n^ Pachal, Peter (23 January 2007). \"Plen, the robot that skates across your desk\". SCI FI Tech. Archived from the original on 2007-10-11.\n\n^ Capuchin on YouTube\n\n^ Wallbot on YouTube\n\n^ Stanford University: Stickybot on YouTube\n\n^ Sfakiotakis, M.; Lane, D.M.; Davies, J.B.C. (April 1999). \"Review of fish swimming modes for aquatic locomotion\". IEEE Journal of Oceanic Engineering. 24 (2): 237–252. Bibcode:1999IJOE...24..237S. CiteSeerX 10.1.1.459.8614. doi:10.1109/48.757275. S2CID 17226211.\n\n^ Richard Mason. \"What is the market for robot fish?\". Archived from the original on 2009-07-04.\n\n^ \"Robotic fish powered by Gumstix PC and PIC\". Human Centred Robotics Group at Essex University. Archived from the original on 2011-08-14. Retrieved 2007-10-25.\n\n^ Witoon Juwarahawong. \"Fish Robot\". Institute of Field Robotics. Archived from the original on 2007-11-04. Retrieved 2007-10-25.\n\n^ \"Festo - AquaPenguin\". 17 April 2009 – via YouTube.\n\n^ \"High-Speed Robotic Fish\". iSplash-Robotics. Archived from the original on 2020-03-11. Retrieved 2017-01-07.\n\n^ \"iSplash-II: Realizing Fast Carangiform Swimming to Outperform a Real Fish\" (PDF). Robotics Group at Essex University. Archived from the original (PDF) on 2015-09-30. Retrieved 2015-09-29.\n\n^ \"iSplash-I: High Performance Swimming Motion of a Carangiform Robotic Fish with Full-Body Coordination\" (PDF). Robotics Group at Essex University. Archived from the original (PDF) on 2015-09-30. Retrieved 2015-09-29.\n\n^ Jaulin, Luc; Le Bars, Fabrice (February 2013). \"An Interval Approach for Stability Analysis: Application to Sailboat Robotics\". IEEE Transactions on Robotics. 29 (1): 282–287. CiteSeerX 10.1.1.711.7180. doi:10.1109/TRO.2012.2217794. S2CID 4977937.\n\n^ \"A Ping-Pong-Playing Terminator\". Popular Science. Archived from the original on 2021-01-22. Retrieved 2010-12-19.\n\n^ \"Synthiam Exosphere combines AI, human operators to train robots\". The Robot Report. Archived from the original on 2020-10-06. Retrieved 2020-04-29.\n\n^ a b Kagan, Eugene; Ben-Gal, Irad (2015). Search and foraging:individual motion and swarm dynamics. Chapman and Hall/CRC. ISBN 9781482242102. Archived from the original on 2023-03-15. Retrieved 2020-08-26.\n\n^ Banks, Jaime (2020). \"Optimus Primed: Media Cultivation of Robot Mental Models and Social Judgments\". Frontiers in Robotics and AI. 7: 62. doi:10.3389/frobt.2020.00062. PMC 7805817. PMID 33501230.\n\n^ a b Wullenkord, Ricarda; Fraune, Marlena R.; Eyssel, Friederike; Sabanovic, Selma (2016). \"Getting in Touch: How imagined, actual, and physical contact affect evaluations of robots\". 2016 25th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). pp. 980–985. doi:10.1109/ROMAN.2016.7745228. ISBN 978-1-5090-3929-6. S2CID 6305599.\n\n^ Norberto Pires, J. (December 2005). \"Robot-by-voice: experiments on commanding an industrial robot using the human voice\". Industrial Robot. 32 (6): 505–511. doi:10.1108/01439910510629244.\n\n^ \"Survey of the State of the Art in Human Language Technology: 1.2: Speech Recognition\". Archived from the original on 2007-11-11.\n\n^ Fournier, Randolph Scott; Schmidt, B. June (1995). \"Voice input technology: Learning style and attitude toward its use\". Delta Pi Epsilon Journal. 37 (1): 1–12. ProQuest 1297783046.\n\n^ \"History of Speech \u0026 Voice Recognition and Transcription Software\". Dragon Naturally Speaking. Archived from the original on 2015-08-13. Retrieved 2007-10-27.\n\n^ Cheng Lin, Kuan; Huang, Tien-Chi; Hung, Jason C.; Yen, Neil Y.; Ju Chen, Szu (7 June 2013). \"Facial emotion recognition towards affective computing-based learning\". Library Hi Tech. 31 (2): 294–307. doi:10.1108/07378831311329068.\n\n^ Walters, M. L.; Syrdal, D. S.; Koay, K. L.; Dautenhahn, K.; Te Boekhorst, R. (2008). \"Human approach distances to a mechanical-looking robot with different robot voice styles\". RO-MAN 2008 - the 17th IEEE International Symposium on Robot and Human Interactive Communication. pp. 707–712. doi:10.1109/ROMAN.2008.4600750. ISBN 978-1-4244-2212-8. S2CID 8653718.\n\n^ Pauletto, Sandra; Bowles, Tristan (2010). \"Designing the emotional content of a robotic speech signal\". Proceedings of the 5th Audio Mostly Conference on a Conference on Interaction with Sound - AM '10. pp. 1–8. doi:10.1145/1859799.1859804. ISBN 978-1-4503-0046-9. S2CID 30423778.\n\n^ Bowles, Tristan; Pauletto, Sandra (2010). Emotions in the Voice: Humanising a Robotic Voice (PDF). Proceedings of the 7th Sound and Music Computing Conference. Barcelona. Archived (PDF) from the original on 2023-02-10. Retrieved 2023-03-15.\n\n^ \"World of 2-XL: Leachim\". www.2xlrobot.com. Archived from the original on 2020-07-05. Retrieved 2019-05-28.\n\n^ \"The Boston Globe from Boston, Massachusetts on June 23, 1974 · 132\". Newspapers.com. 23 June 1974. Archived from the original on 2020-01-10. Retrieved 2019-05-28.\n\n^ a b \"cyberneticzoo.com - Page 135 of 194 - a history of cybernetic animals and early robots\". cyberneticzoo.com. Archived from the original on 2020-08-06. Retrieved 2019-05-28.\n\n^ \"Frubber facial expressions\". Archived from the original on 2009-02-07.\n\n^ \"Best Inventions of 2008 – TIME\". Time. 29 October 2008. Archived from the original on 2008-11-02 – via www.time.com.\n\n^ \"Kismet: Robot at MIT's AI Lab Interacts With Humans\". Sam Ogden. Archived from the original on 2007-10-12. Retrieved 2007-10-28.\n\n^ Waldherr, Stefan; Romero, Roseli; Thrun, Sebastian (1 September 2000). \"A Gesture Based Interface for Human-Robot Interaction\". Autonomous Robots. 9 (2): 151–173. doi:10.1023/A:1008918401478. S2CID 1980239.\n\n^ Li, Ling Hua; Du, Ji Fang (December 2012). \"Visual Based Hand Gesture Recognition Systems\". Applied Mechanics and Materials. 263–266: 2422–2425. Bibcode:2012AMM...263.2422L. doi:10.4028/www.scientific.net/AMM.263-266.2422. S2CID 62744240.\n\n^ \"Armenian Robin the Robot to comfort kids at U.S. clinics starting July\". Public Radio of Armenia. Archived from the original on 2021-05-13. Retrieved 2021-05-13.\n\n^ Park, S.; Sharlin, Ehud; Kitamura, Y.; Lau, E. (29 April 2005). Synthetic Personality in Robots and its Effect on Human-Robot Relationship (Report). doi:10.11575/PRISM/31041. hdl:1880/45619.\n\n^ \"Robot Receptionist Dishes Directions and Attitude\". NPR.org. Archived from the original on 2020-12-01. Retrieved 2018-04-05.\n\n^ \"New Scientist: A good robot has personality but not looks\" (PDF). Archived from the original (PDF) on 2006-09-29.\n\n^ \"Playtime with Pleo, your robotic dinosaur friend\". 25 September 2008. Archived from the original on 2019-01-20. Retrieved 2014-12-14.\n\n^ NOVA conversation with Professor Moravec, October 1997. NOVA Online Archived 2017-08-02 at the Wayback Machine\n\n^ Agarwal, P.K. Elements of Physics XI. Rastogi Publications. p. 2. ISBN 978-81-7133-911-2.\n\n^ Sandhana, Lakshmi (5 September 2002). \"A Theory of Evolution, for Robots\". Wired. Archived from the original on 2014-03-29. Retrieved 2007-10-28.\n\n^ \"Experimental Evolution In Robots Probes The Emergence Of Biological Communication\". Science Daily. 24 February 2007. Archived from the original on 2018-11-16. Retrieved 2007-10-28.\n\n^ Žlajpah, Leon (15 December 2008). \"Simulation in robotics\". Mathematics and Computers in Simulation. 79 (4): 879–897. doi:10.1016/j.matcom.2008.02.017.\n\n^ \"Evolution trains robot teams TRN 051904\". Technology Research News. Archived from the original on 2016-06-23. Retrieved 2009-01-22.\n\n^ Tandon, Prateek (2017). Quantum Robotics. Morgan \u0026 Claypool Publishers. ISBN 978-1627059138.\n\n^ Dragani, Rachelle (8 November 2018). \"Can a robot make you a 'superworker'?\". Verizon Communications. Archived from the original on 2020-08-06. Retrieved 2018-12-03.\n\n^ \"Robotics\". American Elements. Retrieved 2023-04-10.\n\n^ \"Career: Robotics Engineer\". Princeton Review. 2012. Archived from the original on 2015-01-21. Retrieved 2012-01-27.\n\n^ Saad, Ashraf; Kroutil, Ryan (2012). Hands-on Learning of Programming Concepts Using Robotics for Middle and High School Students. Proceedings of the 50th Annual Southeast Regional Conference of the Association for Computing Machinery. ACM. pp. 361–362. doi:10.1145/2184512.2184605.\n\n^ Toy, Tommy (29 June 2011). \"Outlook for robotics and Automation for 2011 and beyond are excellent says expert\". PBT Consulting. Archived from the original on 2012-01-27. Retrieved 2012-01-27.\n\n^ Frey, Carl Benedikt; Osborne, Michael A. (January 2017). \"The future of employment: How susceptible are jobs to computerisation?\". Technological Forecasting and Social Change. 114: 254–280. CiteSeerX 10.1.1.395.416. doi:10.1016/j.techfore.2016.08.019.\n\n^ McGaughey, Ewan (16 October 2019). \"Will robots automate your job away? Full employment, basic income, and economic democracy\". LawArXiv Papers. doi:10.31228/osf.io/udbj8. S2CID 243172487. SSRN 3044448.\n\n^ Hawking, Stephen (1 January 2016). \"This is the most dangerous time for our planet\". The Guardian. Archived from the original on 2021-01-31. Retrieved 2019-11-22.\n\n^ \"Robotics – Thematic Research\". GlobalData. Archived from the original on 2021-09-28. Retrieved 2021-09-22.\n\n^ \"Focal Points Seminar on review articles in the future of work – Safety and health at work – EU-OSHA\". osha.europa.eu. Archived from the original on 2020-01-25. Retrieved 2016-04-19.\n\n^ \"Robotics: Redefining crime prevention, public safety and security\". SourceSecurity.com. Archived from the original on 2017-10-09. Retrieved 2016-09-16.\n\n^ \"Draft Standard for Intelligent Assist Devices — Personnel Safety Requirements\" (PDF). Archived (PDF) from the original on 2020-11-25. Retrieved 2016-06-01.\n\n^ \"ISO/TS 15066:2016 – Robots and robotic devices – Collaborative robots\". 8 March 2016. Archived from the original on 2016-10-10. Retrieved 2016-06-01.\n\n^ Brogårdh, Torgny (January 2007). \"Present and future robot control development—An industrial perspective\". Annual Reviews in Control. 31 (1): 69–79. doi:10.1016/j.arcontrol.2007.01.002. ISSN 1367-5788.\n\n^ Wang, Tian-Miao; Tao, Yong; Liu, Hui (17 April 2018). \"Current Researches and Future Development Trend of Intelligent Robot: A Review\". International Journal of Automation and Computing. 15 (5): 525–546. doi:10.1007/s11633-018-1115-1. ISSN 1476-8186. S2CID 126037910. Archived from the original on 2023-03-15. Retrieved 2023-03-15.\n\n^ Needham, Joseph (1991). Science and Civilisation in China: Volume 2, History of Scientific Thought. Cambridge University Press. ISBN 978-0-521-05800-1.\n\n^ Fowler, Charles B. (October 1967). \"The Museum of Music: A History of Mechanical Instruments\". Music Educators Journal. 54 (2): 45–49. doi:10.2307/3391092. JSTOR 3391092. S2CID 190524140.\n\n^ Rosheim, Mark E. (1994). Robot Evolution: The Development of Anthrobotics. Wiley-IEEE. pp. 9–10. ISBN 978-0-471-02622-8.\n\n^ al-Jazari (Islamic artist) Archived 2008-05-07 at the Wayback Machine, Encyclopædia Britannica.\n\n^ A. P. Yuste. Electrical Engineering Hall of Fame. Early Developments of Wireless Remote Control: The Telekino of Torres-Quevedo,(pdf) vol. 96, No. 1, January 2008, Proceedings of the IEEE.\n\n^ H. R. Everett (2015). Unmanned Systems of World Wars I and II. MIT Press. pp. 91–95. ISBN 978-0-262-02922-3.\n\n^ Randy Alfred, \"Nov. 7, 1905: Remote Control Wows Public\", Wired, 7 November 2011.\n\n^ Williams, Andrew (16 March 2017). History of Digital Games: Developments in Art, Design and Interaction. CRC Press. ISBN 9781317503811.\n\n^ Randell, Brian (October 1982). \"From Analytical Engine to Electronic Digital Computer: The Contributions of Ludgate, Torres, and Bush\". IEEE Annals of the History of Computing. 4 (4): 327–341. doi:10.1109/MAHC.1982.10042. S2CID 1737953.\n\n^ L. Torres Quevedo. Ensayos sobre Automática - Su definicion. Extension teórica de sus aplicaciones, Revista de la Academia de Ciencias Exacta, Revista 12, pp.391-418, 1914.\n\n^ Torres Quevedo, Leonardo. Automática: Complemento de la Teoría de las Máquinas, (pdf), pp. 575-583, Revista de Obras Públicas, 19 November 1914.\n\n^ L. Torres Quevedo. Essais sur l'Automatique - Sa définition. Etendue théorique de ses applications Archived 2023-02-10 at the Wayback Machine, Revue Génerale des Sciences Pures et Appliquées, vol.2, pp.601-611, 1915.\n\n^ B. Randell. Essays on Automatics, The Origins of Digital Computers, pp.89-107, 1982.\n\n^ PhD, Renato M.E. Sabbatini. \"Sabbatini, RME: An Imitation of Life: The First Robots\". Archived from the original on 2009-07-20. Retrieved 2023-03-15.\n\n^ Waurzyniak, Patrick (2006). \"Masters of Manufacturing: Joseph F. Engelberger\". Society of Manufacturing Engineers. 137 (1). Archived from the original on 2011-11-09.\n\n^ \"Humanoid History -WABOT-\". www.humanoid.waseda.ac.jp. Archived from the original on 2017-09-01. Retrieved 2017-05-06.\n\n^ Zeghloul, Saïd; Laribi, Med Amine; Gazeau, Jean-Pierre (21 September 2015). Robotics and Mechatronics: Proceedings of the 4th IFToMM International Symposium on Robotics and Mechatronics. Springer. ISBN 9783319223681. Archived from the original on 2023-03-15. Retrieved 2017-09-10 – via Google Books.\n\n^ \"Historical Android Projects\". androidworld.com. Archived from the original on 2005-11-25. Retrieved 2017-05-06.\n\n^ Robots: From Science Fiction to Technological Revolution Archived 2023-03-15 at the Wayback Machine, page 130\n\n^ Duffy, Vincent G. (19 April 2016). Handbook of Digital Human Modeling: Research for Applied Ergonomics and Human Factors Engineering. CRC Press. ISBN 9781420063523. Archived from the original on 2023-03-15. Retrieved 2017-09-10 – via Google Books.\n\n^ \"KUKA Industrial Robot FAMULUS\". Archived from the original on 2009-02-20. Retrieved 2008-01-10.\n\n^ \"History of Industrial Robots\" (PDF). Archived from the original (PDF) on 2012-12-24. Retrieved 2012-10-27.\n\n^ R. J. Popplestone; A. P. Ambler; I. Bellos (1978). \"RAPT: A language for describing assemblies\". Industrial Robot. 5 (3): 131–137. doi:10.1108/eb004501.\n\n^ Bozinovski, S. (1994). \"Parallel programming for mobile robot control: Agent-based approach\". 14th International Conference on Distributed Computing Systems. pp. 202–208. doi:10.1109/ICDCS.1994.302412. ISBN 0-8186-5840-1. S2CID 27855786.\n\n\nFurther reading[edit]\nR. Andrew Russell (1990). Robot Tactile Sensing. New York: Prentice Hall. ISBN 978-0-13-781592-0.\nMcGaughey, Ewan (16 October 2019). \"Will robots automate your job away? Full employment, basic income, and economic democracy\". LawArXiv Papers. doi:10.31228/osf.io/udbj8. S2CID 243172487. SSRN 3044448.\nAutor, David H. (1 August 2015). \"Why Are There Still So Many Jobs? The History and Future of Workplace Automation\". Journal of Economic Perspectives. 29 (3): 3–30. doi:10.1257/jep.29.3.3. hdl:1721.1/109476.\nTooze, Adam (6 June 2019). \"Democracy and Its Discontents\". The New York Review of Books. Vol. 66, no. 10.\nExternal links[edit]\n.mw-parser-output .side-box{margin:4px 0;box-sizing:border-box;border:1px solid #aaa;font-size:88%;line-height:1.25em;background-color:var(--background-color-interactive-subtle,#f8f9fa);display:flow-root}.mw-parser-output .side-box-abovebelow,.mw-parser-output .side-box-text{padding:0.25em 0.9em}.mw-parser-output .side-box-image{padding:2px 0 2px 0.9em;text-align:center}.mw-parser-output .side-box-imageright{padding:2px 0.9em 2px 0;text-align:center}@media(min-width:500px){.mw-parser-output .side-box-flex{display:flex;align-items:center}.mw-parser-output .side-box-text{flex:1;min-width:0}}@media(min-width:720px){.mw-parser-output .side-box{width:238px}.mw-parser-output .side-box-right{clear:right;float:right;margin-left:1em}.mw-parser-output .side-box-left{margin-right:1em}}.mw-parser-output .sister-box .side-box-abovebelow{padding:0.75em 0;text-align:center}.mw-parser-output .sister-box .side-box-abovebelow\u003eb{display:block}.mw-parser-output .sister-box .side-box-text\u003eul{border-top:1px solid #aaa;padding:0.75em 0;width:217px;margin:0 auto}.mw-parser-output .sister-box .side-box-text\u003eul\u003eli{min-height:31px}.mw-parser-output .sister-logo{display:inline-block;width:31px;line-height:31px;vertical-align:middle;text-align:center}.mw-parser-output .sister-link{display:inline-block;margin-left:4px;width:182px;vertical-align:middle}@media print{body.ns-0 .mw-parser-output .sistersitebox{display:none!important}}@media screen{html.skin-theme-clientpref-night .mw-parser-output .sistersitebox img[src*=\"Wiktionary-logo-v2.svg\"]{background-color:white}}@media screen and (prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .sistersitebox img[src*=\"Wiktionary-logo-v2.svg\"]{background-color:white}}.mw-parser-output .plainlist ol,.mw-parser-output .plainlist ul{line-height:inherit;list-style:none;margin:0;padding:0}.mw-parser-output .plainlist ol li,.mw-parser-output .plainlist ul li{margin-bottom:0}\n\nRobotics  at Wikipedia's sister projects\n\nDefinitions from WiktionaryMedia from CommonsTextbooks from WikibooksResources from Wikiversity\n\nIEEE Robotics and Automation Society\nInvestigation of social robots – Robots that mimic human behaviors and gestures.\nWired's guide to the '50 best robots ever', a mix of robots in fiction (Hal, R2D2, K9) to real robots (Roomba, Mobot, Aibo).\n.mw-parser-output .hlist dl,.mw-parser-output .hlist ol,.mw-parser-output .hlist ul{margin:0;padding:0}.mw-parser-output .hlist dd,.mw-parser-output .hlist dt,.mw-parser-output .hlist li{margin:0;display:inline}.mw-parser-output .hlist.inline,.mw-parser-output .hlist.inline dl,.mw-parser-output .hlist.inline ol,.mw-parser-output .hlist.inline ul,.mw-parser-output .hlist dl dl,.mw-parser-output .hlist dl ol,.mw-parser-output .hlist dl ul,.mw-parser-output .hlist ol dl,.mw-parser-output .hlist ol ol,.mw-parser-output .hlist ol ul,.mw-parser-output .hlist ul dl,.mw-parser-output .hlist ul ol,.mw-parser-output .hlist ul ul{display:inline}.mw-parser-output .hlist .mw-empty-li{display:none}.mw-parser-output .hlist dt::after{content:\": \"}.mw-parser-output .hlist dd::after,.mw-parser-output .hlist li::after{content:\" · \";font-weight:bold}.mw-parser-output .hlist dd:last-child::after,.mw-parser-output .hlist dt:last-child::after,.mw-parser-output .hlist li:last-child::after{content:none}.mw-parser-output .hlist dd dd:first-child::before,.mw-parser-output .hlist dd dt:first-child::before,.mw-parser-output .hlist dd li:first-child::before,.mw-parser-output .hlist dt dd:first-child::before,.mw-parser-output .hlist dt dt:first-child::before,.mw-parser-output .hlist dt li:first-child::before,.mw-parser-output .hlist li dd:first-child::before,.mw-parser-output .hlist li dt:first-child::before,.mw-parser-output .hlist li li:first-child::before{content:\" (\";font-weight:normal}.mw-parser-output .hlist dd dd:last-child::after,.mw-parser-output .hlist dd dt:last-child::after,.mw-parser-output .hlist dd li:last-child::after,.mw-parser-output .hlist dt dd:last-child::after,.mw-parser-output .hlist dt dt:last-child::after,.mw-parser-output .hlist dt li:last-child::after,.mw-parser-output .hlist li dd:last-child::after,.mw-parser-output .hlist li dt:last-child::after,.mw-parser-output .hlist li li:last-child::after{content:\")\";font-weight:normal}.mw-parser-output .hlist ol{counter-reset:listitem}.mw-parser-output .hlist ol\u003eli{counter-increment:listitem}.mw-parser-output .hlist ol\u003eli::before{content:\" \"counter(listitem)\"\\a0 \"}.mw-parser-output .hlist dd ol\u003eli:first-child::before,.mw-parser-output .hlist dt ol\u003eli:first-child::before,.mw-parser-output .hlist li ol\u003eli:first-child::before{content:\" (\"counter(listitem)\"\\a0 \"}.mw-parser-output .navbox{box-sizing:border-box;border:1px solid #a2a9b1;width:100%;clear:both;font-size:88%;text-align:center;padding:1px;margin:1em auto 0}.mw-parser-output .navbox .navbox{margin-top:0}.mw-parser-output .navbox+.navbox,.mw-parser-output .navbox+.navbox-styles+.navbox{margin-top:-1px}.mw-parser-output .navbox-inner,.mw-parser-output .navbox-subgroup{width:100%}.mw-parser-output .navbox-group,.mw-parser-output .navbox-title,.mw-parser-output .navbox-abovebelow{padding:0.25em 1em;line-height:1.5em;text-align:center}.mw-parser-output .navbox-group{white-space:nowrap;text-align:right}.mw-parser-output .navbox,.mw-parser-output .navbox-subgroup{background-color:#fdfdfd}.mw-parser-output .navbox-list{line-height:1.5em;border-color:#fdfdfd}.mw-parser-output .navbox-list-with-group{text-align:left;border-left-width:2px;border-left-style:solid}.mw-parser-output tr+tr\u003e.navbox-abovebelow,.mw-parser-output tr+tr\u003e.navbox-group,.mw-parser-output tr+tr\u003e.navbox-image,.mw-parser-output tr+tr\u003e.navbox-list{border-top:2px solid #fdfdfd}.mw-parser-output .navbox-title{background-color:#ccf}.mw-parser-output .navbox-abovebelow,.mw-parser-output .navbox-group,.mw-parser-output .navbox-subgroup .navbox-title{background-color:#ddf}.mw-parser-output .navbox-subgroup .navbox-group,.mw-parser-output .navbox-subgroup .navbox-abovebelow{background-color:#e6e6ff}.mw-parser-output .navbox-even{background-color:#f7f7f7}.mw-parser-output .navbox-odd{background-color:transparent}.mw-parser-output .navbox .hlist td dl,.mw-parser-output .navbox .hlist td ol,.mw-parser-output .navbox .hlist td ul,.mw-parser-output .navbox td.hlist dl,.mw-parser-output .navbox td.hlist ol,.mw-parser-output .navbox td.hlist ul{padding:0.125em 0}.mw-parser-output .navbox .navbar{display:block;font-size:100%}.mw-parser-output .navbox-title .navbar{float:left;text-align:left;margin-right:0.5em}body.skin--responsive .mw-parser-output .navbox-image img{max-width:none!important}@media print{body.ns-0 .mw-parser-output .navbox{display:none!important}}.mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:\"[ \"}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:\" ]\"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar a\u003espan,.mw-parser-output .navbar a\u003eabbr{text-decoration:inherit}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}html.skin-theme-clientpref-night .mw-parser-output .navbar li a abbr{color:var(--color-base)!important}@media(prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .navbar li a abbr{color:var(--color-base)!important}}@media print{.mw-parser-output .navbar{display:none!important}}vteRoboticsMain articles\nOutline\nGlossary\nIndex\nHistory\nGeography\nHall of Fame\nEthics\nLaws\nCompetitions\nAI competitions\nTypes\nAerobot\nAnthropomorphic\nHumanoid\nAndroid\nCyborg\nGynoid\nClaytronics\nCompanion\nAutomaton\nAnimatronic\nAudio-Animatronics\nIndustrial\nArticulated\narm\nDomestic\nEducational\nEntertainment\nJuggling\nMilitary\nMedical\nService\nDisability\nAgricultural\nFood service\nRetail\nBEAM robotics\nSoft robotics\nClassifications\nBiorobotics\nCloud robotics\nContinuum robot\nUnmanned vehicle\naerial\nground\nMobile robot\nMicrobotics\nNanorobotics\nNecrobotics\nRobotic spacecraft\nSpace probe\nSwarm\nTelerobotics\nUnderwater\nremotely-operated\nRobotic fish\nLocomotion\nTracks\nWalking\nHexapod\nClimbing\nElectric unicycle\nRobotic fins\nNavigation and mapping\nMotion planning\nSimultaneous localization and mapping\nVisual odometry\nVision-guided robot systems\nResearch\nEvolutionary\nKits\nSimulator\nSuite\nOpen-source\nSoftware\nAdaptable\nDevelopmental\nHuman–robot interaction\nParadigms\nPerceptual\nSituated\nUbiquitous\nCompanies\nAmazon Robotics\nAnybots\nBarrett Technology\nBoston Dynamics\nEnergid Technologies\nFarmWise\nFANUC\nFigure AI\nFoster-Miller\nHarvest Automation\nHoneybee Robotics\nIntuitive Surgical\nIRobot\nKUKA\nStarship Technologies\nSymbotic\nUniversal Robotics\nWolf Robotics\nYaskawa\nRelated\nCritique of work\nPowered exoskeleton\nWorkplace robotics safety\nRobotic tech vest\nTechnological unemployment\nTerrainability\nFictional robots\n\n Category\n Outline\n\nvteEngineering\nHistory\nOutline\nList of engineering branches\nSpecialtiesandInterdisciplinarityCivil\nArchitectural\nCoastal\nConstruction\nEarthquake\nEnvironmental\nEcological\nSanitary\nGeological\nGeotechnical\nHydraulic\nMining\nMunicipal/Urban\nOffshore\nRiver\nStructural\nTransportation\nTraffic\nRailway\nMechanical\nAcoustic\nAerospace\nAutomotive\nBiomechanical\nEnergy\nManufacturing\nMarine\nNaval architecture\nRailway\nSports\nThermal\nTribology\nElectrical\nBroadcast\nComputer\noutline\nControl\nElectromechanics\nElectronics\nMicrowaves\nOptical\nPower\nRadio frequency\nSignal processing\nTelecommunications\nChemical\nBiochemical/Bioprocess\nBiological\nBioresource\nGenetic\nTissue\nChemical reaction\nElectrochemical\nFood\nMolecular\nPaper\nPetroleum\nProcess\nReaction\nMaterials\nBiomaterial\nCeramics\nCorrosion\nMetallurgy\nMolecular\nNanotechnology\nPolymers\nSemiconductors\nSurfaces\nOther\nAgricultural\nAudio\nAutomation\nBiomedical\nBioinformatics\nClinical\nHealth technology\nPharmaceutical\nRehabilitation\nBuilding services\nMEP\nGeoengineering\nDesign\nEngineering drawing/graphics\nEngineering management\nEngineering mathematics\nEngineering physics\nExplosives\nFacilities\nFire\nForensic\nGeomatics\nIndustrial\nInformation\nInstrumentation\nand Control\nLogistics\nRobotics\nMechatronics\nMilitary\nNuclear\nOntology\nPackaging\nPrivacy\nSafety\nSurvey\nSecurity\nSoftware\nSustainability\nSystems\nTextile\nEngineering education\nBachelor of Engineering\nBachelor of Science\nMaster's degree\nDoctorate\nGraduate certificate\nEngineer's degree\nLicensed engineer\nRelated topics\nEngineer\nGlossaries\nEngineering\nA–L\nM–Z\nAerospace engineering\nCivil engineering\nElectrical and electronics engineering\nMechanical engineering\nStructural engineering\n\n Category\n Commons\n Wikiproject\n Portal\n\nvteEmerging technologiesFieldsManufacturing\n3D microfabrication\n3D printing\n3D publishing\nClaytronics\nMolecular assembler\nSmart manufacturing\nUtility fog\nMaterials science\nAerogel\nAmorphous metal\nArtificial muscle\nConductive polymer\nFemtotechnology\nFullerene\nGraphene\nHigh-temperature superconductivity\nHigh-temperature superfluidity\nLinear acetylenic carbon\nMetamaterials\nMetamaterial cloaking\nMetal foam\nMulti-function structures\nNanotechnology\nCarbon nanotubes\nMolecular nanotechnology\nNanomaterials\nPicotechnology\nProgrammable matter\nQuantum dots\nSilicene\nSynthetic diamond\nRobotics\nDomotics\nNanorobotics\nPowered exoskeleton\nSelf-reconfiguring modular robot\nSwarm robotics\nUncrewed vehicle\nTopics\nAutomation\nCollingridge dilemma\nDifferential technological development\nDisruptive innovation\nEphemeralization\nEthics\nBioethics\nCyberethics\nNeuroethics\nRobot ethics\nExploratory engineering\nProactionary principle\nTechnological change\nTechnological unemployment\nTechnological convergence\nTechnological evolution\nTechnological paradigm\nTechnology forecasting\nAccelerating change\nFuture-oriented technology analysis\nHorizon scanning\nMoore's law\nTechnological singularity\nTechnology scouting\nTechnology in science fiction\nTechnology readiness level\nTechnology roadmap\nTranshumanism\n\n List\n\nvteGlossaries of science and engineering\nAerospace engineering\nAgriculture\nArchaeology\nArchitecture\nArtificial intelligence\nAstronomy\nBiology\nBotany\nCalculus\nCell biology\nChemistry\nCivil engineering\nClinical research\nComputer hardware\nComputer science\nDevelopmental and reproductive biology\nEcology\nEconomics\nElectrical and electronics engineering\nEngineering\nA–L\nM–Z\nEntomology\nEnvironmental science\nGenetics and evolutionary biology\nCellular and molecular biology\n0–L\nM–Z\nGeography\nA–M\nN–Z\nArabic toponyms\nHebrew toponyms\nWestern and South Asia\nGeology\nIchthyology\nMachine vision\nMathematics\nMechanical engineering\nMedicine\nMeteorology\nMycology\nNanotechnology\nOrnithology\nPhysics\nProbability and statistics\nPsychiatry\nQuantum computing\nRobotics\nScientific naming\nStructural engineering\nVirology\n\n.mw-parser-output .tooltip-dotted{border-bottom:1px dotted;cursor:help}Authority control databases NationalGermanyUnited StatesFranceBnF dataCzech RepublicSpainIsraelOtherNARA\n\n\n\n\n\u003cimg src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?type=1x1\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\"\u003e\nRetrieved from \"https://en.wikipedia.org/w/index.php?title=Robotics\u0026oldid=1251995854\""
  }
]
